{"topic": "tech", "art_add": "https://www.coindesk.com/tech/2026/01/29/dnp-lido-launches-stvaults-to-let-builders-create-new-ethereum-staking-products", "art_title": "Lido’s new stVaults will let L2s create their own rules for Ethereum staking", "discribtion": "stVaults let other teams plug into Lido’s staking system instead of building their own from scratch.", "writer": "Margaux Nijkerk", "time": "Jan 30, 2026, 2:00 p.m.", "what_to_know": "The Lido Labs Foundation unveiled stVaults on the Ethereum mainnet on Friday. In simple terms, stVaults let other teams plug into Lido’s staking system instead of building their own from scratch. stVaults are isolated staking environments that allow teams to run custom validator configurations and optionally mint stETH, while remaining connected to Lido’s liquidity and DeFi integrations.", "text": "The Lido Labs Foundation unveiled stVaults on the Ethereum mainnet on Friday.stVaults marks a shift from a single-product model toward shared staking on the protocol through opening its infrastructure to external builders.In simple terms, stVaults let other teams plug into Lido’s staking system instead of building their own from scratch. Until now, developing an Ethereum staking product typically meant setting up validators, integrations and liquidity independently, which can be a costly and complex process. stVaults aim to lower that barrier by letting builders use Lido’s existing plumbing while customizing how staking works for their users.stVaults are isolated staking environments that allow teams to run custom validator configurations and optionally mint stETH, while remaining connected to Lido’s liquidity and DeFi integrations. Lido said its core staking protocol remains unchanged, with stVaults operating alongside it.The rollout comes as Ethereum staking moves beyond one-size-fits-all products toward more specialized setups. These include institutional-grade staking with stricter controls, application-specific staking products and layer-2 networks embedding staking directly into their infrastructure, all without fragmenting liquidity across competing pools.Initial deployments include Consensys’ layer-2 network Linea, which is using stVaults to stake a portion of bridged ETH and redirect rewards toward liquidity providers and ecosystem incentives. Blockchain analytics firm Nansen is also using stVaults to launch its first Ethereum staking product.\"stVaults show how Ethereum staking is evolving. Different users now need different setups,” said Isidoros Passadis, the chief of staking at the Lido Labs Foundation. “With stVaults, the Lido protocol can support these needs within a single framework while maintaining the liquidity and transparency that stETH is known for.\"Read more: Lido Goes Modular With Vault-Based 'V3' Upgrade", "tags": ["Ethereum News", "Lido"]}
{"topic": "tech", "art_add": "https://www.coindesk.com/tech/2026/01/29/bitcoin-s-quantum-threat-is-real-but-distant-says-wall-street-analyst-as-debate-rages-on", "art_title": "Bitcoin's Quantum threat is ‘real but distant,’ says Wall Street analyst as doomsday debate rages on", "discribtion": "Wall Street broker Benchmark argued the crypto network has ample time to evolve as quantum risks shift from theory to risk management.", "writer": "Will Canny", "time": "UpdatedJan 29, 2026, 8:44 p.m.", "what_to_know": "Broker Benchmark said Bitcoin’s main vulnerability lies in exposed public keys, not the protocol itself. Coinbase’s new Quantum Advisory Council marks a shift from theoretical concern to institutional response. Bitcoin’s architecture is conservative but adaptable, according to Benchmark analyst Mark Palmer, with a long runway for upgrades.", "text": "Quantum computing poses a theoretical threat to Bitcoin, but the risk remains distant and manageable, according to Wall Street broker Benchmark.While quantum machines could eventually compromise certain cryptographic systems, Bitcoin has both the time and engineering path to evolve before that point, according to Benchmark analyst Mark Palmer, who has generally been bullish on the crypto industry as a whole.\"While recent headlines have amplified concern that quantum advances could undermine the protocol’s cryptographic foundations, our analysis suggests that the risk is real but distant, and that it has both the time and technical flexibility required to adapt well before the threat becomes acute,\" Palmer said in the Thursday report.Quantum computing represents a looming cryptographic doomsday because it threatens to break the mathematical lock-and-key system that secures nearly every digital asset. While classical computers would take trillions of years to guess a Bitcoin private key, a sufficiently powerful quantum computer could derive that key from a public address in minutes, effectively allowing an attacker to unmask and drain wallets at will.The protocol’s primary vulnerability lies not in its SHA-256 hashing algorithm, used in mining (mechanism for minting new Bitcoin), but in the elliptic curve digital signature algorithm (ECDSA) that secures users’ private keys, Palmer wrote. Once a public key is revealed, typically when bitcoin is spent, it becomes, in theory, susceptible to a quantum attack.However, Palmer stressed that quantum computers capable of breaking ECDSA do not currently exist and are unlikely to emerge for at least another 10–20 years, if not longer. Today’s quantum systems are small-scale, error-prone, and incapable of sustained computations at the scale required to threaten blockchain infrastructure, the analyst said. Moreover, only a small fraction of the total bitcoin supply, estimated at 1–2 million BTC, is held in addresses with exposed public keys. These include early Satoshi-era coins and reused wallets, but even these are not yet practically vulnerable. Benchmark noted that spending bitcoin triggers a brief window in which the public key is broadcast to the network’s mempool, creating a theoretical opportunity for an attacker to intercept and redirect funds. Yet such a scenario would require an incredibly powerful, fault-tolerant quantum system and perfect execution. While the threat is early, the quantum threat to Bitcoin has recently become a hot topic. Leading bitcoin developers and advocates are pushing back (much like Palmer), arguing that machines capable of breaking Bitcoin’s cryptography do not exist today and are unlikely to for decades. Meanwhile, some investors and Wall Street analysts are weighing the real threat it poses to bitcoin.  Strategy (MSTR) executive chairman Michael Saylor has argued that quantum computing, while often sensationalized, threatens all forms of digital security, from banking to internet communications, not just Bitcoin. On the flipside, Christopher Wood, Jefferies' global head of equity strategy, removed a 10% bitcoin allocation from his model portfolio, citing long-term security concerns posed by advances in quantum computing.Regardless of the debate, the industry is taking preemptive steps for this potential long-term threat. Coinbase’s formation of a Quantum Advisory Council, announced earlier this month, marks a turning point in how quantum risk is managed: moving it from a theoretical conversation into a structured institutional strategy. Even Ethereum has taken the threat seriously and has elevated post-quantum security to a top strategic priority, forming a dedicated \"Post Quantum\" team.To Benchmark's Palmer, it's not all doom and gloom.Even in worst-case scenarios where some early tokens are lost to a quantum attack, Palmer sees no systemic risk to the protocol’s integrity. From an investor’s perspective, quantum computing is a long-term technical consideration, not an immediate threat or an investment thesis-breaker. Near-term drivers for bitcoin’s price remain focused on liquidity conditions, regulatory developments, and institutional adoption, not speculative timelines around quantum supremacy, Palmer added.Read more: Bitcoin’s quantum debate is resurfacing, and markets are starting to notice", "tags": ["Bitcoin News", "quantum computing", "Benchmark"]}
{"topic": "tech", "art_add": "https://www.coindesk.com/tech/2026/01/28/megaeth-mainnet-to-go-live-feb-9-in-major-test-of-real-time-ethereum-scaling", "art_title": "MegaETH mainnet to go live Feb. 9 in major test of ‘real-time’ Ethereum scaling", "discribtion": "This follows its October 2025 $450 million token sale that was heavily oversubscribed.", "writer": "Margaux Nijkerk", "time": "Jan 28, 2026, 6:22 p.m.", "what_to_know": "MegaETH, the much-watched high-performance Ethereum layer-2 network, announcedthat its public mainnetwill go live Feb. 9, marking a major milestone for a project that has gained a lot of attention in the scaling landscape. MegaETH positions itself as a “real-time” blockchain for Ethereum, designed to deliver ultra-low latency and massive transaction throughput.", "text": "MegaETH, the much-watched high-performance Ethereum layer-2 network, announced that its public mainnet will go live Feb. 9, marking a major milestone for a project that has gained a lot of attention in the scaling landscape.MegaETH positions itself as a “real-time” blockchain for Ethereum, designed to deliver ultra-low latency and massive transaction throughput.The project has attracted significant attention and capital over the past year. MegaETH has been backed by prominent figures in the Ethereum ecosystem, like Ethereum co-founders Vitalik Buterin and Joe Lubin, and has raised millions of dollars to date. Most recently in October 2025, it completed a $450 million token sale that was heavily oversubscribed, CoinDesk previously reported.That sale, which offered roughly 5% of the protocol’s 10 billion MEGA supply, saw thousands of investors rush into allocations within minutes, underscoring intense demand for next-generation scaling infrastructure.‌‌The project is being developed by MegaLabs which raised $20 million in a seed round led by Dragonfly in 2024, pitching MegaETH as a new kind of real-time blockchain rather than a traditional scaling solution.MegaLabs has said that the protocol is designed for applications that need near-instant transaction speeds, such as trading platforms, games and other consumer-facing crypto apps — an area where Ethereum has historically struggled during periods of heavy use.Read more: MegaETH Raises $450M in Oversubscribed Token Sale Backed by Ethereum Founders", "tags": ["Ethereum News", "layer 2", "Token Sale"]}
{"topic": "tech", "art_add": "https://www.coindesk.com/tech/2026/01/28/the-protocol-ethereum-to-roll-out-new-ai-agents-standard-soon", "art_title": "The Protocol: Ethereum to roll out new AI agents standard soon", "discribtion": "Plus: Solana’s latest phase, OP token buybacks and EF post-quantum security team.", "writer": "Margaux Nijkerk", "time": "Jan 28, 2026, 4:03 p.m.", "what_to_know": "Ethereum unveils new rules to make AI agents trustworthy Solana’s new phase is \"much more about finance,\" says Backpack CEO Armani Ferrante Optimism community begins vote on OP token buybacks Ethereum Foundation makes post-quantum security a top priority as new team forms", "text": "ETHEREUM’S NEW AI AGENT STANDARD: Ethereum developers are preparing to roll out ERC-8004, a new standard designed to help software agents find each other, prove who they are and decide who to trust when they operate across different systems. The proposal introduces a simple idea: If AI agents are going to transact, coordinate and execute tasks autonomously, they need persistent identities and a shared way to build credibility — much like users, wallets or smart contracts do today. It comes as large companies race to deploy AI agents internally. Most systems still rely on closed identity lists, API keys or bilateral trust agreements. That works inside a firm, but breaks down once agents need to coordinate across vendors, chains or jurisdictions. ERC-8004 defines three lightweight registries that can live on Ethereum mainnet or layer-2 networks. The first is an identity registry, which assigns each agent a unique on-chain identifier using an ERC-721-style token. That identifier points to a registration file describing what the agent does, how to reach it and which protocols it supports. Ownership of the identifier can be transferred, delegated or updated, giving agents portable, censorship-resistant identities. The second is a reputation registry, where clients — human or machine — can submit structured feedback about an agent’s performance. The registry stores raw signals on-chain, while allowing more complex scoring and filtering to happen off-chain. The goal isn’t to rank agents directly but to make reputation data public and reusable across applications. The third is a validation registry, which lets agents request independent checks of their work. Validators could include staked services, machine learning proofs, trusted hardware or other verification systems. These results are stored on the blockchain so other users can see what was checked and by whom. — Shaurya Malwa Read more.SOLANA’S LATEST PHASE IS FOCUSED ON BUILDING: Solana’s latest phase looks a lot less flashy than its memecoin-fueled highs, and that may be the goal. Armani Ferrante, CEO of crypto exchange Backpack, told CoinDesk in an interview the Solana ecosystem has spent the past year doubling down on a more sober focus: financial infrastructure. After years of experimentation as the wider crypto industry focused on NFTs, games and social tokens, attention is now shifting back toward decentralized finance, trading and payments. “People are really starting to think about blockchains as a new kind of financial infrastructure,” Ferrante, who will be speaking at CoinDesk's Consensus Hong Kong conference next month, said. “It’s less about NFTs, less about random moonshot-like games, and much more about finance.” That shift has made Solana feel dull to some outside observers, but Ferrante framed it as a sign of maturity. The network is increasingly positioning itself around high-throughput onchain trading, market structure and settlement, what some have dubbed as “internet capital markets.”The pivot comes amid a stark divide between crypto sentiment and traditional finance. While crypto prices remain subdued and crypto-native investors remain cautious, Ferrante said institutional interest has rarely been stronger. “If you ask anyone on Wall Street, they’ve never been more bullish,” he said, pointing to growing momentum around tokenization, stablecoins and onchain settlement.— Margaux Nijkerk Read more.OPTIMISM BEGINS VOTING ON OP TOKEN BUYBACKS: The Optimism community started voting on a governance proposal linking the value of the OP token more directly to the economic performance of the Superchain, a growing network of Ethereum layer-2 blockchains built using the OP Stack. If approved, the plan introduced by the Optimism Foundation will dedicate half the ether revenue generated by the Superchain sequencer to monthly buybacks of the OP token over an initial 12-month period. The foundation said the plan represents a significant evolution for OP, which has primarily functioned as a governance token, and expects it to translate into structural demand for OP. “Every transaction across every OP Chain expands the base from which buybacks operate,” the proposal states, framing OP as a token increasingly aligned with network usage in addition to its governance role. Voting opened last week and members have 6 days to vote on the proposal. — Margaux Nijkerk Read more.EF UNVEILS POST QUANTUM COMPUTING AS PRIORITY: The Ethereum Foundation (EF), a nonprofit organization that supports Ethereum’s development, is turning its long running post-quantum research into a public engineering push, forming a dedicated “Post Quantum” team and calling the effort a top strategic priority for the network. EF researcher Justin Drake said the new group will be led by researcher Thomas Coratger, who Drake described as a key talent behind \"leanVM.\" Drake framed leanVM as a core part of Ethereum’s broader approach to post-quantum security, arguing that timelines are accelerating and that Ethereum should move into a build phase rather than keep work in the background. The announcement comes as crypto markets have become more sensitive to quantum risk headlines, even if the practical threat remains a longer dated problem. Quantum computing uses new types of processors that could one day break today’s encryption much faster than normal computers. Blockchain developers worry it could eventually expose wallet keys, forcing networks to upgrade cryptography well before that risk becomes real. The bigger issue for large networks is not a single breakthrough moment but the time it takes to ship a safe transition, update wallets and move users onto new formats without breaking daily usage. Drake outlined several near-term steps. A biweekly developer session focused on post-quantum transactions is expected to start next month, led by Antonio Sanso. The agenda is aimed at user-facing defenses, including dedicated cryptographic tools inside the protocol, account abstraction paths and longer-term work on aggregating transaction signatures using leanVM. - Shaurya Malwa Read more.", "tags": ["The Protocol", "Newsletters", "Solana News", "Ethereum News", "Optimism", "AI"]}
{"topic": "tech", "art_add": "https://www.coindesk.com/tech/2026/01/28/peter-thiel-and-galaxy-backed-citrea-wants-to-turn-idle-bitcoin-into-a-high-speed-bank-account", "art_title": "Peter Thiel and Galaxy-backed Citrea wants to turn idle bitcoin into a high-speed bank account", "discribtion": "Founders Fund and Galaxy-backed Citrea is aiming to unlock Bitcoin-denominated credit markets with a new mainnet and a Treasury-backed stablecoin designed for USD settlement.", "writer": "Jamie Crawley", "time": "Jan 28, 2026, 3:10 p.m.", "what_to_know": "Citrea has debuted its mainnet, enabling Bitcoin-backed lending, trading and structured products directly tied to the Bitcoin network. The platform introduced ctUSD, a Treasury-backed stablecoin issued by MoonPay and designed to align with forthcoming U.S. stablecoin rules. Citrea says the rollout aims to mobilize idle BTC and provide an institutional-grade settlement layer for Bitcoin-based capital markets.", "text": "Citrea, a Bitcoin-focused application platform backed by Peter Thiel's Founders Fund and Galaxy Ventures, has unveiled its mainnet, opening the door for bitcoin to be used more directly across lending, trading and U.S. dollar settlement, according to an announcement on Tuesday.The debut also includes ctUSD, a native stablecoin fully backed by short-term U.S. Treasury bills and cash. The token is issued by MoonPay, with Citrea positioning it as compliant with the GENIUS Act framework.The project built ctUSD as a settlement and liquidity layer that can support institutional-grade activity, natively anchored to Bitcoin rather than relying on intermediaries or wrapped BTC.Citrea, which has raised $16.7 million across two funding rounds, is one of numerous Bitcoin-focused projects looking to enable functions on the world's original blockchain. Rather than just holding bitcoin and letting it sit idle in the long term, these firms hope to enable further monetization of investors' bitcoin, including lending and stablecoin issuance. Prominent examples of such competitors include layer-2s Botanix and Stacks.Orkun Kilic, co-founder and CEO of Chainway Labs, which is building Citrea, said the mainnet is designed to bring Bitcoin-secured financial activity onchain, enabling BTC-backed lending and institutional credit with settlement through ctUSD.Citrea said more than 30 Bitcoin-native applications are already prepared to serve users across additional financial use cases, as platforms increasingly look to expand Bitcoin’s role beyond passive holding.", "tags": ["Bitcoin News", "Stablecoin", "Lending", "Rollups"]}
{"topic": "tech", "art_add": "https://www.coindesk.com/tech/2026/01/26/deus-x-capital-s-tim-grant-on-cutting-through-the-crypto-hype", "art_title": "Deus X CEO Tim Grant: We aren't replacing finance; we're integrating it", "discribtion": "The Deus X CEO discussed his journey into digital assets, the company's infrastructure-led growth strategy, and why his Consensus Hong Kong panel promises \"real talk only.\"", "writer": "Will Canny", "time": "UpdatedJan 26, 2026, 8:00 p.m.", "what_to_know": "Tim Grant entered crypto in 2015 after early exposure to Ripple and Coinbase, drawn by blockchain’s ability to improve traditional finance rather than replace it. Deus X combines investing and operating to build regulated digital finance infrastructure across payments, prime services, and institutional DeFi. Grant will be speaking at Consensus Hong Kong in February.", "text": "Deus X Capital's Tim Grant wants real talk only when he's speaking to others in the crypto industry.Deus X is a family office-backed investment and operating company that focuses on unlocking value across capital markets, fintech and digital assets to help build a fairer, more accessible financial system.Led by CEO Grant, Deus X began with roughly $1 billion in assets and operates globally with offices in London, Malta and the UAE. Grant will be speaking at CoinDesk's Consensus Hong Kong conference in February 2026.The firm deploys capital through private equity, venture capital, venture building and fund allocation, backing and building innovative companies that span everything from trading infrastructure and broker-as-a-service platforms to digital asset ventures.\"What I saw was a powerful new toolset and the opportunity to address those inefficiencies in a practical way, faster settlement, lower costs, greater transparency, not by replacing traditional finance, but by integrating with it,\" Grant said about his entry into crypto.Early on in his career, and with no prior knowledge of bitcoin BTC$83,642.21 or blockchain, he said he was lucky enough to meet with the executive teams of both Ripple and Coinbase (COIN) in San Francisco, and that’s where everything changed for him. By the end of 2015 he was in the digital asset space and has been there ever since.\"Our growth strategy at Deus X is deliberately hands-on and infrastructure-led,\" he said. \"We believe⁠ ⁠that the combination of both investing and operating is a powerful combination when it⁠ ⁠comes to executing on growth and generating strong risk-adjusted returns.\"Grant said that means building, backing and operating companies across multiple layers of the digital finance stack, from payments and treasury to institutional DeFi, prime services, market infrastructure and execution tooling.Through businesses like Deus X Pay, Cor Prime and Solstice, Deus X's venture portfolio is expanding, he said, with each company targeting specific problems but largely working together to compound growth and share infrastructure.For Grant, Consensus is about substance rather than spectacle, he said, and given his broad portfolio of investments and companies, he said the companies are always operating across the entire spectrum, both as a provider of capital and as investors in their own ventures.\"We’re looking to engage with institutions, regulators and builders who are focused on deploying digital finance in production, particularly around regulated payments, treasury, tokeni⁠z⁠ation, prime services and institutional DeFi,\" he said.", "tags": ["Consensus Hong Kong 2026", "Tim Grant", "DeFi"]}
{"topic": "tech", "art_add": "https://www.coindesk.com/tech/2026/01/25/solana-s-new-phase-is-much-more-about-finance-says-backpack-ceo-armani-ferrante", "art_title": "Solana’s new phase is ‘much more about finance,’ says Backpack CEO Armani Ferrante", "discribtion": "The Solana ecosystem has spent the past year doubling down on a financial infrastructure, Backpack CEO Armani Ferrante told CoinDesk.", "writer": "Margaux Nijkerk", "time": "Jan 25, 2026, 7:00 p.m.", "what_to_know": "Solana’s latest phase looks a lot less flashy than its memecoin-fueled highs, and that may be the goal. Armani Ferrante, CEO ofcrypto exchange Backpack, told CoinDesk in an interview the Solana ecosystem has spent the past year doubling down on a more sober focus: financial infrastructure. A fter years of experimentation as the wider crypto industry focused on NFTs, games and social tokens, attention is now shifting back toward decentralized finance, trading and payments.", "text": "Solana’s latest phase looks a lot less flashy than its memecoin-fueled highs, and that may be the goal.Armani Ferrante, CEO of crypto exchange Backpack, told CoinDesk in an interview the Solana ecosystem has spent the past year doubling down on a more sober focus: financial infrastructure. After years of experimentation as the wider crypto industry focused on NFTs, games and social tokens, attention is now shifting back toward decentralized finance, trading and payments.“People are really starting to think about blockchains as a new kind of financial infrastructure,” Ferrante, who will be speaking at CoinDesk's Consensus Hong Kong conference next month, said. “It’s less about NFTs, less about random moonshot-like games, and much more about finance.”That shift has made Solana feel dull to some outside observers, but Ferrante framed it as a sign of maturity. The network is increasingly positioning itself around high-throughput onchain trading, market structure and settlement, what some have dubbed as “internet capital markets.”The pivot comes amid a stark divide between crypto sentiment and traditional finance. While crypto prices remain subdued and crypto-native investors remain cautious, Ferrante said institutional interest has rarely been stronger.“If you ask anyone on Wall Street, they’ve never been more bullish,” he said, pointing to growing momentum around tokenization, stablecoins and onchain settlement.Ferrante argued that the long-term case for Solana, and blockchains more broadly, rests on their role as neutral settlement layers. In that future, assets like stocks and derivatives move seamlessly across platforms as standardized tokens rather than sitting in siloed databases.“A token is just a canonical, agreed-upon ledger entry for who owns something,” Ferrante said. “That concept applies everywhere.”Crucially, Ferrante emphasized that real-world adoption will require deeper integration with regulatory frameworks, not an escape from them. As crypto moves from speculative experimentation toward embedded financial infrastructure, compliance and legal clarity become prerequisites rather than obstacles.“What maturity actually means is the real world,” he said. “And the real world isn’t a free-for-all.”In Ferrante’s view, Solana’s bet is that building for that reality, even at the cost of hype, will pay off as more of global finance moves on-chain.Read more: Ethereum and Solana set the stage for 2026’s DeFi reboot", "tags": ["Solana News", "Backpack", "Consensus Hong Kong 2026"]}
{"topic": "tech", "art_add": "https://www.coindesk.com/tech/2026/01/24/ethereum-foundation-makes-post-quantum-security-a-top-priority-as-new-team-forms", "art_title": "Ethereum Foundation makes post quantum security a top priority as new team forms", "discribtion": "EF researcher Justin Drake says a new post-quantum team will drive wallet safety upgrades, research prizes and test networks as quantum timelines shorten.", "writer": "Shaurya Malwa", "time": "UpdatedJan 24, 2026, 3:08 p.m.", "what_to_know": "The Ethereum Foundation has elevated post-quantum security to a top strategic priority, forming a dedicated Post Quantum team led by Thomas Coratger with support from leanVM cryptographer Emile. Researcher Justin Drake said Ethereum is shifting from background research to active engineering, including biweekly developer sessions on post-quantum transactions and multi-client post-quantum consensus test networks. The foundation is backing new cryptography with funding and outreach, launching two $1 million prizes, planning post-quantum community events and education, and stressing that blockchains must prepare early for quantum threats despite their long-term nature.", "text": "The Ethereum Foundation (EF), a nonprofit organization that supports Ethereum’s development, is turning its long running post quantum research into a public engineering push, forming a dedicated Post Quantum team and calling the effort a top strategic priority for the network.EF researcher Justin Drake said the new group will be led by Thomas Coratger, with support from Emile, who Drake described as a key talent behind \"leanVM.\"Drake framed leanVM as a core part of Ethereum’s broader approach to post quantum security, arguing that timelines are accelerating and that Ethereum should move into a build phase rather than keep work in the background.Today marks an inflection in the Ethereum Foundation's long-term quantum strategy.We've formed a new Post Quantum (PQ) team, led by the brilliant Thomas Coratger (@tcoratger). Joining him is Emile, one of the world-class talents behind leanVM. leanVM is the cryptographic…The announcement comes as crypto markets have become more sensitive to quantum risk headlines, even if the practical threat remains a longer dated problem.Quantum computing uses new types of processors that could one day break today’s encryption much faster than normal computers. Blockchain developers worry it could eventually expose wallet keys, forcing networks to upgrade cryptography well before that risk becomes real.The bigger issue for large networks is not a single breakthrough moment but the time it takes to ship a safe transition, update wallets and move users onto new formats without breaking daily usage.Drake outlined several near-term steps. A biweekly developer session focused on post-quantum transactions is expected to start next month, led by Antonio Sanso. The agenda is aimed at user-facing defenses, including dedicated cryptographic tools inside the protocol, account abstraction paths and longer-term work on aggregating transaction signatures using leanVM.EF is also funding cryptography research. Drake said it is announcing a $1 million Poseidon Prize to harden the Poseidon hash function and pointed to another $1 million post-quantum initiative called the Proximity Prize. On the engineering side, Drake said multi-client post-quantum consensus dev networks are already running, with multiple teams participating and weekly interoperability calls to coordinate.Ethereum also plans more community work. Drake said the EF will host a post-quantum event in October and a post-quantum day in late March ahead of EthCC, alongside education efforts that include a video series and enterprise-focused materials.Others in the ecosystem echoed the urgency. Pantera Capital general partner Franklin Bi said on X that traditional finance could take years to upgrade systems, while blockchains may be able to coordinate a full-stack software transition faster.The post-quantum race begins. My prediction:People are over-estimating how quickly Wall Street will adapt to post-quantum cryptography. Like any systemic software upgrade, it'll be slow & chaotic with single points of failure for years. Traditional systems are only as strong… https://t.co/6mEdFKcXrm", "tags": []}
{"topic": "tech", "art_add": "https://www.coindesk.com/tech/2026/01/23/ethereum-blockchain-beats-its-own-speed-ups-but-there-s-a-catch", "art_title": "Ethereum blockchain beats its own speed-ups, but there's a catch", "discribtion": "Ethereum’s daily active addresses climbed above major layer-2 networks in January as lower fees revived on-chain activity.", "writer": "Shaurya Malwa", "time": "UpdatedJan 23, 2026, 12:37 p.m.", "what_to_know": "Ethereum mainnet daily active addresses briefly topped 1.3 million, as December’s Fusaka upgrade lowered transaction fees and drew activity back from layer-2 networks. Security researchers say much of the apparent growth in new addresses stems from address poisoning attacks, in which attackers send tiny stablecoin transfers to millions of wallets to trick users into copying look-alike addresses. The cheap post-upgrade fees have both revived legitimate stablecoin usage on Ethereum and enabled large-scale spam campaigns, inflating headline activity metrics while contributing to at least $740,000 in confirmed losses.", "text": "Ethereum, the smart contract blockchain, now handles more daily activity than its cheaper side chains, called Layer -2 networks. But this comeback has a catch – not all of that Ethereum activity appears to reflect genuine user demand.The number of daily active addresses on Ethereum climbed toward the 1 million mark earlier this month, briefly peaking above 1.3 million on Jan. 16 before settling closer to 950,000, according to data source Token Terminal. That puts Ethereum ahead of popular scaling networks such as Arbitrum, Base and OP Mainnet, reversing much of the narrative that users had permanently migrated off L1.Active addresses are the unique blockchain wallets that make transactions, like sending, receiving cryptocurrencies, or interacting with smart contracts, in a given time period, let's say daily. Analysts track the metric to study the real network usage beyond the token price hype. Layer 2 scaling networks are like side roads or express lanes built on top of the main blockchain highway, Ethereum. These sidechains handle tons of transaction traffic quickly and cheaply off the main chain, and then communicate the final tally back to the main chain for security.The rebound in Ethereum activity follows December’s Fusaka upgrade, which sharply reduced transaction fees and made it cheaper to transact directly on Ethereum again. Lower costs have helped revive on-chain activity, particularly for stablecoins, which remain the dominant use case for day-to-day transfers.At face value, the numbers suggest a “return to mainnet” moment. But analysts caution that raw address counts can be misleading, especially when fees fall far enough to make spam economical.Imagine spam calls flooding your phone. your call log looks busy, but most are junk, not real conversations. Something similar has been happening on Ethereum, as a significant portion of January’s address growth is tied to address poisoning attacks rather than organic adoption. Security researcher Andrey Sergeenkov said in a post earlier this week that the spike aligns closely with a rise in dusting activity, where attackers send tiny stablecoin transfers to millions of wallets.Address poisoning works by exploiting human behavior. Attackers generate wallet addresses that closely resemble a victim’s real address, often matching the first and last characters. They then send small “dust” transfers, usually under $1, so the fake address appears in the victim’s transaction history. When the victim later copies an address from that history instead of a trusted source, funds are mistakenly sent to the attacker.Sergeenkov’s analysis found that the number of new Ethereum addresses jumped to roughly 2.7 million during the peak week of Jan. 12, about 170% above normal levels. Around two-thirds of those addresses received dust as their first stablecoin transaction, a strong signal of poisoning activity rather than real onboarding.The attack has already resulted in more than $740,000 in confirmed losses, with most of the stolen funds coming from a small number of victims. Lower fees following Fusaka appear to have made these campaigns viable, allowing attackers to spray transactions at scale with limited upfront cost.The takeaway is not that Ethereum usage is fake, but that headline metrics need context. Lower fees have clearly brought activity back to mainnet, especially for stablecoins. At the same time, cheap transactions also enable abuse, inflating address counts and transaction volumes.", "tags": ["Ethereum News", "blockchain contracts"]}
{"topic": "tech", "art_add": "https://www.coindesk.com/tech/2026/01/22/ethereum-upgrade-sparks-activity-spike-but-jpmorgan-doubts-it-will-last", "art_title": "Ethereum upgrade sparks activity spike, but JPMorgan doubts it will last", "discribtion": "The Fusaka upgrade raised usage, but pressure from layer-2 networks and rival blockchains continues to cloud Ethereum's long-term growth outlook.", "writer": "Will Canny", "time": "UpdatedJan 22, 2026, 8:00 p.m.", "what_to_know": "JPMorgan said Ethereum’s Fusaka upgrade cut fees and increased transactions and active addresses. The bank questioned whether the rebound can persist given competition from layer-2 blockchains and rival chains. Waning speculation and lower fee burn could weigh on ether over time.", "text": "Ethereum’s latest upgrade sparked a burst of activity, but Wall Street bank JPMorgan (JPM) is skeptical it will last. In a Wednesday note to clients, the bank said December's Fusaka upgrade expanded data capacity and drove an immediate drop in fees alongside a jump in transactions and active addresses.Fusaka builds on the Pectra upgrade earlier in 2025, the report said, which helped revive usage after the Dencun upgrade pushed activity toward layer-2 networks. While the combined upgrades lifted network activity over the past year, the bank warned that in the past, similar rebounds have tended to fade.\"Historically, Ethereum’s successive upgrades have failed to meaningfully enhance network activity on a sustained basis,\" analysts led by Nikolaos Panigirtzoglou wrote.Fusaka expanded the network’s data capacity by increasing the number of \"blobs\" per block, a change aimed at lowering transaction costs and improving throughput, particularly for layer-2 networks that rely on the blockchain for data availability. By allowing more data to be posted per block, Fusaka helped ease congestion and pushed fees lower, addressing a bottleneck that emerged after earlier upgrades shifted activity away from the main chain.The layer 2s themselves are adding to the pressure. The analysts pointed to the ongoing shift of activity to blockchains such as Base, Arbitrum and Optimism, noting that Base now generates the majority of layer-2 revenue. The bank's analysts also flagged growing competition from faster, cheaper blockchains like Solana, as well as the fading of speculative booms tied to non-fungible tokens (NFTs), memecoins and initial coin offerings (ICOs).A layer 1 network is the base layer, or the underlying infrastructure of a blockchain. Layer 2 refers to a set of offchain systems or separate blockchains built on top of layer 1s.Capital is fragmenting across application-specific chains, the analysts said, citing moves by Uniswap and dYdX that have diverted liquidity and revenue away from Ethereum. The result has been lower fee burning, rising ether ETH$2,688.36 supply and a decline in total value locked (TVL) in ETH terms.Fusaka delivered a clear short-term boost, but persistent structural headwinds leave the bank doubtful that Ethereum’s latest activity surge marks a lasting turnaround.The world's second-largest cryptocurrency was trading 2.2% higher at $2,992 at publication time.Read more: Staking goes mainstream: what 2026 could look like for ether investors", "tags": ["Ethereum News", "Ether", "Fusaka", "JPMorgan"]}
{"topic": "tech", "art_add": "https://www.coindesk.com/tech/2026/01/21/the-protocol-staked-eth-exit-queue-moves-down-to-zero", "art_title": "The Protocol: Staked ETH exit queue moves down to zero", "discribtion": "Also: Neobanks trending, DVT staking proposal and Solayer $35M fund", "writer": "Margaux Nijkerk", "time": "Jan 21, 2026, 4:33 p.m.", "what_to_know": "Ethereum transactions hit a record as the staking exit queue drops to zero Stablecoins and self-custody are driving the rise of crypto neobanks Vitalik Buterin proposes simpler ‘distributed validator’ staking for Ethereum Solayer unveils $35 million fund for real-time DeFi, AI and tokenization apps on infiniSVM", "text": "ETH STAKING EXIT QUEUE DROPS TO ZERO: Ethereum is processing more transactions than at any point in its history, with daily activity pushing to new records last week. The network processed a record 2,885,524 transactions last week, the highest daily count in its history. The surge caps a sharp pickup in onchain activity this month, with transaction volumes pushing to new highs into early 2026. Activity has accelerated since mid-December, reversing a gradual slowdown that persisted through much of 2025. At the same time, average fees remain near recent lows, even with the pickup in usage. The combination points to a network that is absorbing higher demand more smoothly than past cycles, helped by recent upgrades and more activity moving to layer-2 networks. Staking dynamics have also shifted. Ethereum’s validator exit queue has fallen to zero, meaning stakers can now withdraw ETH almost immediately, while entry queues still show long waits. The empty exit queue mainly shows there isn’t a big rush to lock up ETH or pull it out right now, and staking looks steady rather than in a boom. — Shaurya Malwa Read more.NEOBANK TRENDS GROWS THANKS TO STABLECOINS AND PAYMENTS: For years, crypto’s most ambitious builders focused on the industry’s plumbing: faster blockchains, cleaner smart contracts, better protocol economics. But a growing number of projects are now stepping away from the base layer and into something far more familiar to everyday users: payments, cards and neobank-like services. The shift reflects a broader realization inside crypto: while protocols matter, adoption tends to follow utility. Projects are now starting to pitch something else: that users can spend, save, and borrow with crypto without needing to understand the technicalities underneath it all. The evolution in messaging comes as stablecoins are positioned as having an everyday financial use case. Research from Messari argues the next phase of crypto neobanks won’t simply mirror fintech apps on top of blockchains, but instead will attempt to rebuild core banking functions, like spending and borrowing directly onchain without relying on traditional payment rails. Ethereum restaking platform ether.fi was among the crypto-native projects to make that pivot, moving beyond protocol development toward offering payment and banking-style services built on top of decentralized finance. Since then, the trend has only accelerated. Polygon, long known primarily as a scaling network for Ethereum, recently announced new acquisitions for crypto rails and payments infrastructure for stablecoin use cases. — Margaux Nijkerk Read more.VITALIK PROPOSES DVT STAKING: Ethereum co-founder Vitalik Buterin has outlined a proposal to build distributed validator technology (DVT) directly into Ethereum’s staking protocol, aiming to make staking more resilient while dramatically reducing technical complexity for large ETH holders. DVT enables validators to operate across multiple machines rather than relying on a single node. In existing implementations, a validator’s cryptographic key is split across multiple nodes that collectively sign messages. As long as more than two-thirds of those nodes behave honestly, the validator continues to operate normally without risking penalties such as slashing or inactivity leaks. While DVT is already in use in some protocols today, Buterin argues that these solutions remain difficult to set up and maintain. They often require complex inter-node networking and depend on cryptographic properties that may not be suitable in the long term.Buterin’s proposal replaces that complexity with a protocol-level solution. Instead of relying on external coordination layers, Ethereum itself would support validators that operate as groups. — Margaux Nijkerk Read more.SOLAYER UNVEILS $35M FUND: Solayer unveiled a $35 million ecosystem fund to back blockchain applications built on its infiniSVM network, targeting projects that require real-time execution and can generate sustainable revenue. The capital comes from Solayer Labs and the Solayer Foundation. The fund will support early and growth-stage teams building on infiniSVM, a layer-1 blockchain compatible with Solana’s tooling but designed for faster execution and near-instant settlement. Solayer said the network has demonstrated throughput above 330,000 transactions per second and finality of roughly 400 milliseconds. “We’re solving for real-time behavior, immediate, guaranteed settlement and low latency,” said Joshua Sum, Solayer’s chief product officer, in an interview with CoinDesk. “Most blockchains still batch transactions, like legacy financial systems. We want to replace that with actual real-time clearing.” - Olivier Acuna Read more.", "tags": ["The Protocol", "Newsletter", "Ethereum News", "Staking", "Funding", "Vitalik Buterin"]}
{"topic": "tech", "art_add": "https://www.coindesk.com/tech/2026/01/21/vitalik-buterin-proposes-simpler-distributed-validator-staking-for-ethereum", "art_title": "Vitalik Buterin proposes simpler ‘distributed validator’ staking for Ethereum", "discribtion": "The aim is to make staking more resilient while dramatically reducing technical complexity for large ETH holders.", "writer": "Margaux Nijkerk", "time": "Jan 21, 2026, 1:43 p.m.", "what_to_know": "Ethereum co-founder Vitalik Buterinhas outlined a proposalto build distributed validator technology (DVT) directly into Ethereum’s staking protocol, aiming to make staking more resilient while dramatically reducing technical complexity for large ETH holders. DVT allows validators to operate across multiple machines instead of relying on a single node. In existing implementations, a validator’s cryptographic key is split across several nodes, which collectively sign messages.", "text": "Ethereum co-founder Vitalik Buterin has outlined a proposal to build distributed validator technology (DVT) directly into Ethereum’s staking protocol, aiming to make staking more resilient while dramatically reducing technical complexity for large ETH holders.DVT allows validators to operate across multiple machines instead of relying on a single node. In existing implementations, a validator’s cryptographic key is split across several nodes, which collectively sign messages. As long as more than two-thirds of those nodes behave honestly, the validator continues to operate normally without risking penalties such as slashing or inactivity leaks.While DVT is already in use today in some protocols, Buterin argues these solutions remain difficult to set up and maintain. They often require complex networking between nodes and depend on cryptographic properties that may not be suitable in the long term.Buterin’s proposal replaces that complexity with a protocol-level solution. Instead of relying on external coordination layers, Ethereum itself would support validators that operate as groups.Under the design, a validator with enough ETH could register up to 16 individual keys, creating multiple “virtual identities” that each behave like independent validators but are treated as a single unit by the protocol. Ethereum would only recognize actions, such as proposing blocks or signing attestations, if a minimum number of those identities sign off, based on a user-defined threshold.Buterin says the proposal could have two major benefits. First, it would allow security-conscious stakers, including individual “whales” and institutions, to stake in a safer, multi-node setup without relying on centralized staking providers. Second, it could improve Ethereum’s overall staking decentralization by encouraging large holders to run their own infrastructure rather than delegating to dominant services.“This design is extremely simple from the perspective of a user,” Buterin wrote.The proposal remains a research idea and would require further discussion before being considered for inclusion in the Ethereum protocol. Still, it reflects a broader push among Ethereum developers to make staking more secure, accessible and decentralized, without making it harder to run.Read more: Decentralized autonomous organizations need a rethink, Ethereum co-founder says", "tags": ["Ethereum News", "Vitalik Buterin", "Staking", "Validators", "distributed validator technology"]}
