{"topic": "policy", "art_add": "https://www.coindesk.com/policy/2026/01/30/polymarket-kalshi-contract-limits-demonstrated-in-latest-u-s-government-shutdown-fight", "art_title": "Polymarket, Kalshi contract limits demonstrated in latest U.S. government shutdown fight", "discribtion": "The U.S. government is likely to shut down Saturday morning until the House votes on a funding package, raising the importance of specificity in prediction market bets.", "writer": "Nikhilesh De", "time": "Jan 31, 2026, 2:19 a.m.", "what_to_know": "", "text": "The U.S. government is set to partially shut down at midnight, despite the Senate voting in favor of a funding package intended to keep the government running — showing the importance of specificity in prediction market contracts.The House of Representatives is out of session this week, and will not be back until Monday. Because the House needs to pass the package the Senate voted on Friday evening, this means that the government will technically shut down at 12:00 a.m. ET Saturday, and likely remain shut through the weekend. It's just a partial shutdown and should not have a significant effect on U.S. residents.In this way, the shutdown differs radically from the previous U.S. government shutdown, which was the longest in the nation's history and saw federal employees go unpaid for well over a month while lawmakers negotiated over forthcoming healthcare premium increases.Polymarket and Kalshi contracts letting users bet on whether the government will shut down or not ranged in how exactly they defined a government shutdown, demonstrating the importance of specificity for these event contracts.\"This market will resolve to 'Yes' if the U.S. Office of Personnel Management (OPM) announces another federal government shutdown due to a lapse in appropriations by January 31, 2026, 11:59 PM ET. Otherwise, this market will resolve to 'No,'\" one contract read. Under the terms of this contract, a partial shutdown qualifies as a shutdown, but importantly, it is dependent on OPM announcing a shutdown.Earlier Friday evening, it gave the odds as being 88%, having climbed steadily from 40% over the past 24 hours despite reporting from Thursday making it clear that the House would not be able to vote before Monday.A similar Kalshi contract likewise pointed to OPM as its way of verifying the outcome of the bet. The odds of a shutdown were 93% at press time, having climbed from 44% over the past 24 hours.OPM's media response email did not immediately return a request for comment on whether it would announce a shutdown.Other bets were more specific. One Polymarket contract allowed users to bet how long the government might remain closed, with one, two and three-plus days all seeing 90%+ chances at press time. A Kalshi counterpart suggested bettors gave \"more than [two] days\" over 90% odds.Yet another Polymarket contract asking whether government funding would lapse on January 31 stood at a 99.6% chance at press time, defining a lapse as \"the President failing to sign the relevant bill(s) extending government funding\" by 11:59 p.m. ET on Friday night — which, again, he can't do until the House votes on the package on Monday.", "tags": ["Polymarket", "U.S. Government"]}
{"topic": "policy", "art_add": "https://www.coindesk.com/policy/2026/01/30/u-s-government-seizes-usd400-million-helix-allegedly-made-from-drug-linked-transactions", "art_title": "U.S. government seizes $400 million Helix allegedly made from drug-linked transactions", "discribtion": "The Department of Justice said it now holds legal title over crypto, real estate and monetary assets tied to darknet mixing service, Helix", "writer": "Olivier Acuna", "time": "Jan 30, 2026, 7:26 p.m.", "what_to_know": "The U.S. government has secured legal title to more than $400 million in seized cryptocurrency, real estate and cash linked to the darknet bitcoin mixing service Helix. Prosecutors say Helix, which processed at least 354,468 bitcoin largely tied to darknet drug markets, was widely used by online drug dealers and other criminals to launder illicit profits. Helix operator Larry Dean Harmon pleaded guilty to conspiracy to commit money laundering and was sentenced in November 2024 to 36 months in prison, three years of supervised release and significant forfeitures, as part of a broader DOJ cybercrime crackdown.", "text": "The U.S. government now has the legal title to more than $400 million worth of seized cryptocurrency, real estate and cash linked to the once-popular darknet bitcoin mixing service Helix, the Department of Justice (DOJ) announced on Thursday. Mixing services like Helix are designed to obscure the origin and destination of crypto transactions by pooling and redistributing funds, a practice long scrutinized by law enforcement and regulators. The DOJ alleged that Helix in particular was used by drug traffickers and other criminals to launder money.According to court documents, Helix was among the most widely used mixing services on the darknet, particularly by online drug dealers seeking to launder illicit profits. Investigators said Helix processed at least 354,468 bitcoin, valued at roughly $300 million at the time, much of it tied to darknet drug markets. Helix's operator, Larry Dean Harmon collected commissions and fees on these transactions.Harmon pleaded guilty in August 2021 to conspiracy to commit money laundering and was sentenced in November 2024 to 36 months in prison, followed by three years of supervised release, along with a forfeiture money judgment and the forfeiture of seized property.Harmon also operated Grams, a darknet search engine designed to connect users to major darknet markets. Helix’s application programming interface (API) allowed darknet marketplaces to integrate the mixer directly into their bitcoin withdrawal systems, enabling seamlessSince 2020, the DOJ Criminal Division’s Computer Crime and Intellectual Property Section (CCIPS) has secured more than 180 cybercrime convictions and court orders for the return of over $350 million in victim funds, according to the Justice Department.", "tags": ["Department of Justice", "Dark Web", "Cryptocurrency"]}
{"topic": "policy", "art_add": "https://www.coindesk.com/policy/2026/01/30/brian-armstrong-was-snubbed-and-insulted-by-top-executives-from-the-biggest-u-s-banks-in-davos-wsj", "art_title": "Brian Armstrong was snubbed by top executives from the biggest U.S. banks in Davos", "discribtion": "Stablecoin rewards and the Clarity Act widen the divide between crypto and TradFi, according to people who spoke with the WSJ.", "writer": "Helene Braun", "time": "UpdatedJan 30, 2026, 6:43 p.m.", "what_to_know": "Coinbase CEO Brian Armstrong faced a frosty reception from top Wall Street bank chiefs in Davos as he lobbied against a key Senate crypto bill. Armstrong argues that traditional banks are pushing the Clarity Act to curb stablecoin rewards, which function like high-yield interest accounts and could threaten deposit-based banking models. The clash over the Clarity Act could reshape who is allowed to offer stablecoin products, even as Coinbase continues to partner with major banks such as JPMorgan and Citigroup.", "text": "Coinbase (COIN) CEO Brian Armstrong is running into a wall — and it looks a lot like the heads of America’s biggest banks.During meetings at the World Economic Forum in Davos, Armstrong reportedly approached several Wall Street leaders to discuss the crypto market structure bill moving through Congress, according to a report the Wall Street Journal (WSJ) on Thursday.The reception was icy.JPMorgan Chase CEO Jamie Dimon told Armstrong, “You are full of s---,” according to people familiar with the exchange who spoke with the WSJ. Bank of America’s Brian Moynihan sat for a 30-minute meeting but dismissed Armstrong’s position, saying, “If you want to be a bank, just be a bank.” Wells Fargo CEO Charlie Scharf refused to engage, saying there was “nothing for them to talk about.” Citigroup’s Jane Fraser gave him under a minute.The frost comes as Armstrong has turned sharply against the Senate’s crypto bill. After reviewing a draft, he announced on X that Coinbase “can’t support the bill as written.” He later warned that traditional banks were lobbying to protect their turf by targeting stablecoin rewards — recurring payouts to users who hold tokens like USDC.These rewards function like interest-bearing accounts but typically offer higher yields — up to 3.5%. Banks argue they pose a threat to deposit-based models that fund lending and other core services. If users shift en masse to stablecoins, the impact on local lending and smaller banks could be significant. Armstrong says the answer is simple: compete.The legislation, known as the CLARITY Act, could determine who gets to offer these products — and under what rules. Its outcome could reset the playing field between banks and crypto platforms.Still, the line between the two industries isn’t as sharp as the public standoff suggests. Coinbase maintains partnerships with major banks, including JPMorgan and Citi. That makes the current dispute less about total disruption and more about who sets the terms for the next phase of digital finance.CoinDesk reached out to Coinbase, JPMorgan, Bank of America, Wells Fargo and Citigroup for comment but none was received by press time. ", "tags": ["Coinbase", "Brian Armstrong"]}
{"topic": "policy", "art_add": "https://www.coindesk.com/policy/2026/01/30/who-is-kevin-warsh-here-is-what-trump-nominee-for-fed-chair-said-about-bitcoin-and-rates", "art_title": "Bitcoin is the 'newest, coolest software': Inside Kevin Warsh’s complicated crypto history", "discribtion": "The former Federal Reserve governor has invested in crypto firms, criticized bitcoin’s role as money and argued for a U.S. digital dollar.", "writer": "Olivier Acuna", "time": "UpdatedJan 30, 2026, 6:39 p.m.", "what_to_know": "President Donald Trump’s surprise nomination of former Fed governor Kevin Warsh as the next Federal Reserve chair jolted markets, boosting the dollar, pressuring bitcoin and increasing equity volatility. Warsh, a veteran of the 2008 financial crisis with experience on Wall Street and in Washington, is known for favoring tighter monetary policy, higher real interest rates and a smaller Fed balance sheet, a stance seen as challenging for risk assets like bitcoin. Though skeptical of cryptocurrencies as money, Warsh has invested in crypto startups, supports central bank engagement with digital money and is viewed as pragmatic rather than hostile to crypto, with analysts expecting his focus to be on financial stability and institutional credibility.", "text": "The market was initially jolted by the sudden news of President Donald Trump naming Kevin Warsh as his choice for the next Federal Reserve chair, ending a month-long saga of guessing game.The U.S. dollar rallied, bitcoin fell, and the equity market became volatile when the news broke; while the market might have stabilized a bit for now, the uncertainty is still gripping the traders across all asset classes.So who is Kevin Warsh, and more importantly, how will his leadership shape the future of monetary policy and crypto?Kevin Maxwell Warsh is a former U.S. Federal Reserve governor who served from 2006 to 2011 and played a senior role during the 2008 global financial crisis, including acting as a key liaison between the Fed and financial markets.Before joining the central bank, Warsh worked at Morgan Stanley and served in the George W. Bush administration as Special Assistant to the President for Economic Policy and Executive Secretary of the National Economic Council, giving him experience spanning Wall Street and Washington.After leaving the Fed, Warsh became a visiting fellow at Stanford University’s Hoover Institution, where he has written extensively on monetary policy, central bank credibility and what he views as the long-term risks of prolonged balance-sheet expansion by central banks.It's worth noting here that while the nomination spooked the market and bitcoin, Federal Reserve Chair Jerome Powell — whose second four-year term expires on May 15, 2026 — is eligible to remain on the Fed’s Board of Governors until Jan. 31, 2028. Warsh must still be confirmed by the Senate before assuming the role, but a vacancy created by Governor Stephen Miran’s expiring temporary term on Jan. 31, 2026 could allow him to join the board ahead of May.Warsh’s appointment has drawn particular scrutiny from digital-asset investors — at least initially — given his long-held views on monetary discipline and skepticism toward bitcoin’s role as money.While the concern is not with Warsh personally, his background has led many market participants to view him as potentially bearish for bitcoin and other risk assets. He is broadly viewed as favoring monetary discipline, higher real rates, and a smaller Fed balance sheet, all of which oppose a liquidity-heavy environment that has historically backed risk assets.So what are his ties to crypto?First, let's take a look at what he said about bitcoin previously.In public commentary in 2015, Warsh approached bitcoin and cryptocurrencies primarily through a monetary-policy lens, expressing skepticism about their use as stable mediums of exchange while acknowledging the potential of blockchain technology.“The underlying technology in that white paper, it’s just software,” Warsh said during a video conversation with Stanley Drukenmiller. “It’s just the newest, coolest software that will provide us the opportunity to do things we could never have done before.\"While acknowledging all software can be used for good and for evil, Warsh said that by building it here in the U.S., that gives us the opportunity to be more productive and create something very special over the next decade…”At one point in the conversation with the billionaire hedge fund manager and his former colleague, Warsh told Drukenmiller, “You made reference to Bitcoin and I thought I heard a little condescension in your voice, that people are buying bitcoin.”He went on to make a case in favour of bitcoin, saying “it could provide market discipline, it could tell the world that things need to be fixed.” He also said he thinks of “bitcoin as a lot of things, but certainly with every passing day it's getting new life as an alternative currency.”While the interview is from 2015, when bitcoin was still seen as dangerous and mostly used for illegal activities, a lot has changed in the last eleven years. Now, the U.S. has a pro-crypto government, there is legislation in the works to create a legal framework for digital assets, and, most importantly, crypto has become too big to ignore, even for Wall Street giants.The potential future Fed chair has argued that central banks must engage with digital money, including considering a U.S. central bank digital currency (CBDC) to counter bitcoin and rival China’s digital yuan. Worth noting that CBDC is a hotly debated topic in the crypto community due to privacy concerns.He also said cryptocurrency was nothing more than \"software pretending to be money.” He categorized cryptocurrencies as a symptom of \"speculative excess\" driven by loose monetary policy and argued that Bitcoin's rise was largely a derivative of the \"global dollar flood\" and that, as liquidity tightens, such assets are likely to lose their appeal.Warsh also had close ties with crypto in general.Warsh has drawn attention in crypto circles for his early involvement with digital-asset firms, including Bitwise Asset Management, a crypto index fund provider. Warsh was an investor in a cryptocurrency project called Basis, an algorithmic central bank. He also served as an adviser for Electric Capital, a VC firm focused on crypto, blockchain and fintech.Market analysts covering crypto have said Warsh’s policy outlook, which emphasizes institutional credibility and monetary discipline, could matter for liquidity conditions affecting risk assets such as bitcoin.Warsh is not a crypto evangelist, but has expressed a nuanced, pragmatic stance on innovation and regulation. Analysts view him as cautious about private crypto volatility and as more focused on systemic financial stability than on championing unregulated markets.While criticizing its use as money, Warsh has conceded that bitcoin could potentially serve as a \"sustainable store of value, like gold.\" However, he maintains that its boom-and-bust cycles are speculative and may foretell \"heightened market volatility\" across broader financial assets.“Warsh is not viewed as hostile to crypto, and the prospect of a new Fed Chair perceived as more inclined toward rate cuts could trigger a short-term relief rally across risk assets,” Market analyst and Adlunam founder Jason Fernandes said.“However, without a genuine macroeconomic justification for easing, any such move will be met with skepticism and sold into,” Fernandes added.", "tags": ["Federal Reserve", "Kevin Warsh", "Jerome Powell", "Donald Trump"]}
{"topic": "policy", "art_add": "https://www.coindesk.com/policy/2026/01/30/citi-says-clarity-act-momentum-builds-but-defi-fight-could-stall-crypto-bill", "art_title": "Citi says CLARITY Act momentum builds, but DeFi fight could stall crypto bill", "discribtion": "Washington is edging closer to a landmark crypto framework, though disputes over DeFi and stablecoin rewards risk pushing final passage beyond 2026.", "writer": "Will Canny", "time": "Jan 30, 2026, 3:02 p.m.", "what_to_know": "Citi said the CLARITY Act remains the central legitimizing force for U.S. digital assets, with lawmakers eyeing spring milestones but rising risk of delays. DeFi definitions are the hardest fight, while stablecoin rewards offer the clearest path to compromise. The bank said tokenized equities could move forward through hybrids, pilots or tighter securities labeling.", "text": "Citi (C) said the CLARITY Act remains the key catalyst for legitimizing digital assets in the U.S., but progress is slowed by negotiations over its most contentious provisions.While the Senate Agriculture Committee has advanced its version of the bill, the bank noted the Banking Committee still controls the toughest issues, leaving timelines uncertain. Lawmakers are expected to keep working even during a potential shutdown, with target dates in the coming months still attainable, though there is a rising risk that talks delay final passage beyond 2026.\"We see the passage of the CLARITY Act as the essential catalyst for advancing/legitimizing digital assets,\" analysts led by Peter Christiansen said in the Friday report.Crypto market structure legislation aims to define who regulates digital assets in the U.S., how tokens are classified and which activities fall under securities or commodities law. The framework is critical to giving crypto firms and investors legal clarity, reducing regulatory overlap and bringing activity back into the country after years of enforcement-driven oversight drove companies abroad.The bill's supporters argue that clear rules will unlock institutional adoption, encourage innovation and curb offshore risk, while critics warn that poorly drawn lines could stifle decentralized technologies.The analysts flagged decentralized finance (DeFi) definitions as the biggest hurdle, with debate focused on defining the point at which decentralized protocols, software and developers become regulated service providers. An overly restrictive framework could weigh on Web3 development, decentralized exchanges, derivatives, stablecoin yield and layer-2 networks, with any compromise likely to hinge on custody and surveillance rather than pure software neutrality, the analysts said.The analysts also said they see more scope for compromise on stablecoin rewards, suggesting options such as time-limited yield or alternative incentive structures, even as banks warn of regulatory arbitrage and crypto firms argue rewards are key to adoption. Citi said the issue does not undermine its longer-term view on cross-border and business-to-business stablecoin use.On tokenized equities, the report said fears of bypassing traditional market infrastructure have driven resistance, but potential workarounds include clearly classifying tokens as securities, keeping distribution within existing rails, using hybrid settlement models or launching an SEC pilot. Such approaches could support innovation without upending the securities value chain, the report added.Coinbase's (COIN) decision to end support for U.S. market structure legislation won't derail the process, investment bank HSBC said in a report earlier this week, suggesting that while the exchanges CEO, Brian Armstrong, prefers no bill over a bad bill, he would probably accept a sensible compromise.Read more: Coinbase opposition won't stymie U.S. crypto market structure bill, HSBC says", "tags": ["Cryptocurrency Regulations", "Market Structure Legislation", "Citigroup"]}
{"topic": "policy", "art_add": "https://www.coindesk.com/policy/2026/01/30/president-donald-trump-nominates-kevin-warsh-as-fed-chair", "art_title": "President Donald Trump nominates Kevin Warsh as Fed Chair", "discribtion": "The president confirmed his pick on Friday to replace the incumbent Jerome Powell when his term ends in May.", "writer": "Jamie Crawley", "time": "UpdatedJan 30, 2026, 12:32 p.m.", "what_to_know": "President Donald Trump nominated Kevin Warsh to be the new chair of the Federal Reserve. The president confirmed his pick on Friday to replace the incumbent Jerome Powell when his term ends in May. Warsh's appointment his considered by some to be bearish for risk assets such as BTC given his emphasis on monetary discipline, which could mean higher real interest rates.", "text": "President Donald Trump nominated Kevin Warsh to be the new chair of the Federal Reserve.The President confirmed his pick in a post on Truth Social on Friday to replace the incumbent Jerome Powell when his term ends in May.Warsh served on the U.S. central bank’s Board of Governors between 2006 and 2011, the youngest person to ever do so. He was considered the frontrunner to be Trump's pick, something which may have played a part in bitcoin's BTC$83,642.21 dive to nearly $81,000 late Thursday, as odds of Warsh's nomination spiked on betting sites.Warsh was an investor in a cryptocurrency project called Basis, which described itself as an algorithmic central bank. He has also served as an adviser for Electric Capital, a VC firm focused on crypto, blockchain and fintech.However, his appointment his considered by some to be bearish for risk assets such as BTC given his emphasis on monetary discipline, which could mean higher real interest rates.Bitcoin enjoyed a brief 0.7% lift immediately after Trump's announcement before returning to the $82,600 mark it sat at previously, according to CoinDesk data.UPDATE (Jan. 30, 12:25 UTC): Adds more detail and context throughout. ", "tags": ["Donald Trump", "Federal Reserve", "Jerome Powell", "FastNews"]}
{"topic": "policy", "art_add": "https://www.coindesk.com/policy/2026/01/29/el-salvador-s-central-bank-buys-usd50-million-of-gold-as-government-keeps-adding-bitcoin", "art_title": "El Salvador's central bank buys $50 million of gold as government keeps adding bitcoin", "discribtion": "The bitcoin-friendly nation's central bank now holds over $360 million of the yellow metal, while the government, led by President Nayib Bukele, has bitcoin holdings worth $635 million.", "writer": "Krisztian Sandor", "time": "UpdatedJan 30, 2026, 6:03 p.m.", "what_to_know": "El Salvador's central bank added $50 million of gold to its reserves on Thursday. The country also made its usual purchase of 1 bitcoin, bringing the government’s holdings to 7,547 coins, worth $635 million.", "text": "The central bank of El Salvador, the tiny bitcoin-friendly nation in Central America, added $50 million worth of gold to its reserves, the institution said Thursday in an X post.The purchase — 9,298 troy ounces — brings the country's total gold holdings to 67,403 ounces, valued at roughly $360 million at current pricesPresident Nayib Bukele reposted the announcement, writing, \"We just bought the other dip.\" Whether Bukele was applauding the gold buy or cheekily announcing the government's own bitcoin buy wasn't clear. Arkham data did show the country adding one bitcoin to its holdings on Thursday, in line with Bukele's ongoing pledge for his government to buy one bitcoin per day.The country's stack, according to Arkham, now stands at 7,547 bitcoin worth $635 million at bitcoin's currently depressed price just above $84,000.", "tags": ["El Salvador", "Gold"]}
{"topic": "policy", "art_add": "https://www.coindesk.com/policy/2026/01/29/u-s-sec-cftc-chiefs-push-united-front-on-paving-the-way-for-crypto", "art_title": "U.S. SEC, CFTC chiefs push united front on paving the way for crypto", "discribtion": "With Commodity Futures Trading Commission head Mike Selig new in the role, the agencies held a \"harmonization\" event to show they're side-by-side.", "writer": "Jesse Hamilton", "time": "UpdatedJan 29, 2026, 7:55 p.m.", "what_to_know": "New CFTC Chairman Mike Selig revealed an ambitious crypto agenda as he and SEC Chairman Paul Atkins held a \"harmonization\" event to demonstrate a united effort on digital assets. Selig said he'd pursue a number of CFTC policies, including on crypto definitions, tokenized collateral and prediction markets.", "text": "The leaders of the two federal agencies that have U.S. crypto's fate most in their hands stood together at an event on Thursday, and they said they'd pursue common policies to define digital assets jurisdictions.Even as crypto legislation moves in fits and starts through Congress, the U.S. Securities and Exchange Commission and the Commodity Futures Trading Commission have been trying to advance regulatory policy to give the industry some comfort in doing U.S. business. The CFTC has a new leader, Mike Selig, who was sworn in last month after his Senate confirmation and is already moving forward on crypto initiatives, using his remarks to outline a new agenda that will include rules on defining crypto and regulating prediction markets. The CFTC will seek to join the SEC's \"commonsense crypto asset taxonomy\" to make it clear that digital commodities, collectibles and tools aren't securities. Selig said he's directed his staff to work together with the SEC \"to consider joint codification of this framework as an interim measure while Congress finalizes legislation.\"In his first public remarks on the job, Selig said Thursday's event marked \"the beginning of a new chapter for the CFTC.\"\"We are witnessing the foundation of modern markets take shape,\" he said. \"As this transformation unfolds, the CFTC has an opportunity to build on its historic role as a forward looking regulator.\"He said the CFTC's work known as its \"crypto sprint\" will become a partnership in Project Crypto.\"Chairman Selig brings to the CFTC precisely what this moment demands: a deep respect for market integrity, paired with a practical understanding of how innovation drives prosperity for the American people.,\" said SEC chairman Paul Atkins, whose first year at the helm has already represented a sharp reversal of Democratic predecessor Gary Gensler's stance on the digital assets sector. Atkins said the agencies will be \"deploying every tool at our disposal to reduce friction, to harmonize standards and definitions where appropriate, and to equip markets with confidence as Congress completes its vital work.\"The SEC is responsible for securities, and that will include tokenization and any cryptocurrencies that are deemed to check that box, though leading tokens such as bitcoin BTC$83,642.21 and Ethereum's ether ETH$2,688.23 are under the CFTC's jurisdiction.The event was in part a redux of a previous joint meeting between Atkins and Selig's immediate predecessor, then-Acting Chairman Caroline Pham, though its now been repeated by the two full-time agency aheads appointed by President Donald Trump and included Selig's detailed outline of policy intentions.On his new agenda, Selig said he's directed staff on several points:Selig also said he'd pursue a new approach on prediction markets, an area in which the agency had long been mired in legal battles over the legality of those businesses.\"Looking ahead, and in the spirit of markets that trade on expectations, I have directed CFTC staff to move forward with drafting an event contracts rulemaking,\" Selig said. UPDATE (January 29, 2025, 19:44 UTC): Adds comments from CFTC Chairman Selig.", "tags": ["U.S. Securities and Exchange Commission", "U.S. Commodity Futures Trading Commission", "Regulations"]}
{"topic": "policy", "art_add": "https://www.coindesk.com/policy/2026/01/29/sec-chair-says-time-is-right-for-pension-funds-to-include-crypto-cftc-head-says-digital-assets-set-to-flourish", "art_title": "SEC chair says 'time is right' for pension funds to include crypto, CFTC head says digital assets set to flourish", "discribtion": "SEC Chair Paul Atkins and CFTC Chair Mike Selig said they are working with the Senate to get a crypto market structure bill over the line.", "writer": "Olivier Acuna", "time": "Jan 29, 2026, 5:04 p.m.", "what_to_know": "SEC Chair Paul Atkins said the \"time is right\" for 401(k) plans to include cryptocurrency, provided it is done in a measured way with guardrails to protect retirees. The remarks came as the Senate Agriculture Committee advanced a draft crypto market structure bill that would expand the CFTC's role and clarify its oversight boundaries with the SEC, though the legislation still faces a long road to becoming law. CFTC Chair Michael Selig predicted digital assets will \"flourish\" under forthcoming U.S. rules, arguing that clear national standards could bring blockchain firms back onshore and make the U.S. a premier hub for crypto markets.", "text": "SEC Chair Paul Atkins said “the time is right” for retirement plans including 401(k)s to include cryptocurrency, while CFTC Chair Michael Selig predicted digital assets will “flourish” once Congress finalizes U.S. market structure rules.The comments in a CNBC interview were made as Senate Agriculture Committee lawmakers began marking up a draft crypto market structure bill, legislation that could expand the Commodity Futures Trading Commission's role and clarify oversight boundaries with the Securities and Exchange Commission. The committee took less than an hour to advance the legislation to the full Senate, though it still has a lengthy path before it can become law“A lot of people are already exposed to crypto and other sorts of assets like that through their pension funds,” Atkins said. “I think the time is right to go forward with that,” although, Atkins said, “in a measured way that has guardrails to protect the retirees.”The Department of Labor previously said fiduciaries should “exercise extreme care before they consider adding a cryptocurrency option to a 401(k) plan's investment menu for plan participants.\" In August 2025, President Donald Trump signed an executive order to allow crypto investments in 401(k) retirement plans, opening the gates for a $10 trillion market to flow into the asset class. The White House said at the time that alternative assets, including digital assets, offer competitive returns and diversification benefits.Selig, for his part, said the crypto industry is at a pivotal moment with regulations on the cusp of approval, and laid out an optimistic future for digital assets. He also said it is time to bring back to the U.S. the blockchain companies that migrated elsewhere due the lack of regulatory clarity.“Blockchain technology has now been around for about 15 years and it's really transforming the way that these markets are really developing within our remit,” he said. “We’ve seen a lot of these technologies and assets move offshore and we want to bring them back.”Selig expressed confidence in legislation with the collaboration between the SEC and the CFTC to finalize “the national rules of the road that will allow the asset class to flourish here in America.”“If we can set the standard in the United States, really a gold standard for crypto asset markets we are going to see a lot of new types of products, a lot of new types of onchain markets and financial applications and that's going to bring us into the future and make the us the premier place to do business to offer digital assets.”", "tags": ["Securities and Exchange Commission", "CFTC", "Cryptocurrency", "Regulations"]}
{"topic": "policy", "art_add": "https://www.coindesk.com/policy/2026/01/29/crypto-bill-clears-u-s-senate-milestone-as-effort-advanced-through-first-committee", "art_title": "Crypto bill clears U.S. Senate milestone despite Democrat opposition", "discribtion": "The market structure legislation for the first time advanced beyond a committee, setting up the next steps that could end with a vote of the overall chamber.", "writer": "Jesse Hamilton", "time": "UpdatedJan 29, 2026, 6:12 p.m.", "what_to_know": "After a brief series of amendments were rejected, the U.S. Senate Agriculture Committee voted to advance its version of the crypto market structure bill to its next phase. That a high-water mark for market structure legislation in the Senate, after years of negotiation and lobbying, but the bill still needs to same treatment at the Senate Banking Committee. It's also lacking Democratic support that would be required for an eventual passage in the overall Senate, though Democrats remain at the negotiating table.", "text": "A U.S. Senate committee formally advanced the crypto market structure bill on Thursday, moving to a new stage with the legislation that the industry hopes will help it reach a new plateau of investor confidence and involvement.This is as far as the crypto sector's top policy effort has ever progressed in the Senate, though there are some headwinds. The committee working on the bill was the Senate Agriculture Committee, and its Republican chairman chose to step away from negotiations and vote on the legislation without bipartisan support. The resulting Republican-driven result — concluding quickly with a 12-11 party-line vote — will still need to gather significant Democratic support before it can eventually clear the structural hurdles of the Senate.\"After months of work, we have made significant progress, really significant progress working together,\" said committee Chairman John Boozman, as the panel began work. \"Now it's time to move this process forward.\"Democrats at the long-awaited markup session lined up as a unified block to oppose Republican preferences, illustrating the partisan standoff that's yet to be overcome. Several Democrats noted they hope to keep working on it to get to a bipartisan version, and Boozman himself acknowledged that the text can be updated through a manager's amendment before it proceeds through the Senate.\"The progress that has been made here is good, but I think we believe that we're not quite done yet,\" said Senator Amy Klobuchar, the panel's ranking Democrat. \"I hope we can continue to negotiate as this bill moves forward.\"The Agriculture Committee is one of two panels that ultimately need to sign off on the legislation. However, it's the Senate Banking Committee that might have the tougher time, because its version of the Digital Asset Market Clarity Act contains some of the more controversial elements, including the question of stablecoin yield. That effort, though, has been delayed in its own markup and stymied by the search for a compromise that will satisfy a number of interests, including Wall Street banking lobbyists.The White House intends to host another meeting next week with the intent to find common ground among crypto, banking, Republican, Democratic and administration interests. President Donald Trump and his representatives have pushed back on a couple of central points in the legislative effort, including Democrats' demands that he and other senior government officials be blocked from personally benefiting from crypto business interests.Senator Corey Booker, the lead Democrat negotiator, said the White House has made progress on the bill \"infinitely harder.\"\"This is ridiculous that the president of the United States and his family have made billions of dollars off of this industry and are still trying to create a framework here without the kind of ethics that would prevent this kind of gross corruption in our country,\" Booker said.On Thursday, the hearing's first amendment addressed the Democrats' ethics component.Boozman also seemed to support another of the Democrats' requests, that the Commodity Futures Trading Commission get a full slate of commissioners as it moves into a leading role in overseeing crypto.\"It's essential to have a completely staffed, bipartisan commission,\" he said.The chairman noted as the markup concluded that the committee now needs to work with its Banking Committee counterparts and with lawmakers in the House of Representatives to come up with something that can be supported by both parties. He also said some of the amendments offered were better suited to that committee's version of the bill.If all goes well, this is what's needed to turn the bill into law:The crypto industry is already sitting on a high-stakes win in this congressional session, having advanced a bill to govern U.S. stablecoin issuers into law, making its first major legislative victory in the U.S. But the industry has a tightening window to get this even bigger bill through as the Senate battles over federal funding and is getting nearer November's midterm elections.Read More: Live blog: Senate Agriculture Committee advances crypto market structure bill", "tags": ["Senate Agriculture Committee", "Market Structure Legislation", "U.S. Senate"]}
{"topic": "policy", "art_add": "https://www.coindesk.com/policy/2026/01/29/live-crypto-bill-reaches-u-s-senate-milestone-as-lawmakers-mull-changes-on-way-to-vote", "art_title": "Live blog: Senate Agriculture Committee advances crypto market structure bill", "discribtion": "The Senate Agriculture Committee held a markup hearing on crypto market structure legislation.", "writer": "Nikhilesh De", "time": "UpdatedJan 29, 2026, 4:48 p.m.", "what_to_know": "The Senate Agriculture Committee is holding a markup hearing on crypto market structure legislation, letting lawmakers debate amendments on the underlying text. They'll ultimately vote on the bill itself at the end of the hearing. CoinDesk is providing live updates on the hearing as it continues through Thursday. In opening remarks, Democrats urged Committee Chairman John Boozman to support a more bipartisan bill, saying both parties wanted to support legislation.", "text": "The U.S. Senate's Agriculture Committee is holding its first markup hearing on crypto market structure legislation, giving lawmakers a chance to debate and vote on amendments and possibly advance the actual legislation.ND (11:30 a.m. ET): After less than an hour of debate and just a handful of amendments, the Senate Agriculture Committee voted to advance its market structure legislation to the full Senate on a party-line vote (12 lawmakers voted for it, 11 against). All eyes are now back on the Senate Banking Committee, which postponed its own markup hearing earlier this month and has yet to set a new date. ND (11:28 a.m. ET): Unmentioned so far in Thursday's hearing: The crypto markets themselves, which were down heavily between 4% and 7% over the past 24 hours of trading. Bitcoin hovered around $84,000 at press time.JH (11:24 a.m. ET): We moved from Democrat amendments to a Republican one that's meant to block foreign adversaries of the U.S. from meddling in the U.S. crypto markets. Senator Tommy Tuberville pushed the amendment \"about ensuring our digital markets are not compromised by our enemies.\"But Tuberville agreed to withdraw his amendments with an understanding of \"what we're trying to accomplish today,\" he said. So he asked that the ideas can come up again later.ND (11:22a.m. ET): More from Booker earlier:\"What I and so many of my colleagues on both sides of the aisle see is that we are standing on the cusp of extraordinary humanity, changing breakthroughs that could give Americans a financial system that is faster, cheaper and more inclusive,\" he said. \"I have seen in my own community that the system we have right now often screws customers, hurts their ability to access financial markets. There is a democratizing force, or at least potential that is moving across our country and across the world.\"Senator Adam Schiff of California likewise commented that Democrats had a working group to support crypto legislation, likening crypto to artificial intelligence: \"We want these jobs. We want this industry to stay in the United States, and that means that we need to have rules of the road where we're not essentially making decisions through litigation.\" However, he expected that the bill will advance on party lines due to the partisan nature of the bill, he said. JH (11:17 a.m. ET): The opening Democratic amendments went down, as expected, in party-line votes, including the standout issue meant to target President Donald Trump's crypto business interests.It's been a cordial disagreement so far today, with Democrats gently accusing that Republicans abandoned negotiations and Republicans gently suggesting that disagreements can be resolved later.ND (11:14 a.m. ET): The second amendment offered, this time by Senator Dick Durbin of Illinois, would prohibit the Federal Reserve and the Treasury Department from \"providing digital commodity intermediaries with a taxpayer-funded bailout\" in the event of banking failures, pointing to Silicon Valley Bank, Silvergate Bank and Signature Bank. Boozman said that \"nothing in the bill would grant the CFTC authority\" to provide bankruptcy assistance, calling the amendment \"unnecessary.\" The amendment failed 11-12 on party lines. ND (11:08 a.m. ET): The first amendment, offered by Senator Michael Bennett, a Colorado Democrat, addressed Democrats' concerns about U.S. President Donald Trump's profiting off of his family's various crypto interests and businesses. \"I think this issue strikes at the core of our democracy,\" Bennett said. \"This amendment is not about crypto or even particularly about President Trump. It's about returning to a system of government and ethics that that we thought the American people deserved.\"Boozman said he was opposed to the amendment as it reached \"way beyond\" the Agriculture Committee's jurisdiction.The amendment failed 11-12 on party line votes.ND (10:56 a.m. ET): The Thursday hearing will see lawmakers offer up amendments on the underlying text, which the committee published last week. While the Senators were working on bipartisan legislation, Committee Chairman John Boozman said in a statement last week that \"fundamental differences in policy\" remained and the members of the committee had not come to an agreement on the text that was published.Senator Cory Booker, the Democrat leading negotiations on the bill, said in opening remarks that lawmakers were close to an agreement on key issues, pointing to U.S. President Donald Trump and his family's crypto ties as one outstanding area of concern, as well as the lack of a firm agreement on quorum at federal agencies. \"In football parlance, we moved from our own goal line all the way down 70 yards. We're almost in the red zone on this bill, and that frustrates me, because I see a bipartisan glide path to land this plane, to punch through the end zone,\" Booker said. Boozman, in his own opening remarks, said lawmakers had made \"really significant progress\" in putting the bill together. \"Advancing this bill is the first step, and there are many steps to come in achieving those goals,\" he said. \"I also encourage that the administration and Senate leadership to coordinate and ensure that the CFTC is fully constituted and adequately funded.\"", "tags": ["crypto legislation", "Market Structure Legislation", "Live Blog"]}
{"topic": "policy", "art_add": "https://www.coindesk.com/policy/2026/01/29/russia-to-roll-out-crypto-market-rules-by-2027-rules-out-bitcoin-and-ether-as-legal-tender", "art_title": "Russia plans to cap retail crypto buys at $4,000 as it brings digital assets into the legal fold", "discribtion": "Russian lawmakers plan crypto regulations by midyear, permitting trading for qualified and retail investors while banning anonymous coins and domestic payments.", "writer": "Olivier Acuna", "time": "UpdatedJan 29, 2026, 2:11 p.m.", "what_to_know": "Russia plans to introduce a comprehensive crypto market regulatory framework by July 1, 2027. Both qualified and unqualified investors will be allowed to buy cryptocurrencies under different rules, with qualified investors facing mandatory risk testing but no limits on most purchases. The central bank is expected to approve a shortlist of major cryptocurrencies such as bitcoin and ether for broad trading, ban privacy coins like monero and zcash, and impose penalties comparable to illegal banking for unlawful crypto activities.", "text": "The head of Russia's lower house of the country’s parliament on Thursday said crypto market regulations will be ready by June of this year and come into force on July 1, 2027.Anatoly Aksakov, head of the State Duma Committee on Financial Markets, said that qualified and unqualified investors will be allowed to purchase cryptocurrencies although under separate rules, according to the Duma’s official news outlet.A cap will be in place on retail investors' crypto purchases with the figure of 300,000 rubles ($4,000) being discussed, he added.Qualified investors will also be required to undergo mandatory testing to ensure they understand the risks of cryptocurrency transactions, but they will be able to purchase any crypto assets in unlimited quantities, with the exception of anonymous ones.Aksakov also said the crypto market framework will include penalties for illegal activities of intermediaries in the cryptocurrency that are similar to sanctions for illegal banking activities.Russia’s central bank laid out a proposed framework in December that would legalize and regulate cryptocurrency trading for both individuals and institutions, continuing its softening stance toward cryptocurrencies. However, it continues to caution that investing in crypto carries risks, including potential losses. The central bank also said digital currencies and stablecoins are recognized as monetary assets, but they cannot be used for domestic payments.Aksakov said cryptocurrency miners will be allowed to “legalize themselves as much as possible. We plan to establish administrative, financial, and, quite possibly, criminal liability for illegal activity in this market in separate legislation.\"The parliamentary news outlet included comments from a lawyer saying the central bank will be tasked with compiling a list of top five to 10 cryptocurrencies permitted for trading. “These will definitely include BTC and ETH. They might also add SOL or TON, given their popularity in our country. The rest are only for qualified investors,\" the expert said.\"The Central Bank explicitly states: you cannot buy coins that conceal their intended recipients,\" such as “monero XMR$475.65, zcash ZEC$329.58, and dash. After all, if you can't construct a transaction graph and see where the money came from, such an asset won't pass AML (anti-money laundering) checks.\"", "tags": ["Russia", "crypto regulatioin", "Bitcoin News"]}
