{"topic": "business", "art_add": "https://www.coindesk.com/business/2026/01/30/tether-s-gold-holdings-top-usd17-billion-as-net-profits-surpassed-usd10-billion-for-2025", "art_title": "Tether's gold holdings top $17 billion as net profits surpassed $10 billion for 2025", "discribtion": "The stablecoin giant saw sharp growth in its USDT token's supply, and was one of the world's largest U.S. government debt holder with $141 billion Treasury exposure.", "writer": "Krisztian Sandor", "time": "Jan 31, 2026, 12:10 a.m.", "what_to_know": "Tether reported more than $10 billion in net profit for 2025, driven by growth in its USDT stablecoin and increased exposure to U.S. Treasuries. The company ended the year with $6.3 billion in excess reserves backing $186.5 billion in USDT liabilities, making it one of the largest holders of U.S. government debt with up to $141 billion in Treasury exposure. The firm held $17.4 billion and $8.4 billion worth of bitcoin in the reserve.", "text": "Tether, issuer of the world's most popular stablecoin USDT, wrapped up 2025 with a net profit of over $10 billion, the company reported Friday, bolstered by steady growth in its flagship token and growing exposure to U.S. Treasuries and gold.The fourth-quarter attestation, signed by accounting firm BDO Italy, showed Tether holding $6.3 billion in excess reserves, a buffer over its $186.5 billion in liabilities tied to issued tokens. USDT’s circulating supply grew by $50 billion over the year, to over $186 billion.The firm continued ramping up its holdings of U.S. Treasuries, reaching $122 billion in direct exposure and $141 billion including overnight reverse repurchase agreements. That positions the company among the largest holders of U.S. government debt globally.Tether also maintained significant allocations to gold and bitcoin, reporting holdings of $17.4 billion and $8.4 billion, respectively. The company has been buying physical gold at a rate of up to two tons a week, a pace that could total more than $1 billion in monthly purchases, according to a Bloomberg interview with Ardoino earlier this month.Tether's investment portfolio, which is separated from reserve assets, was valued at $20 billion.\"With USDT issuance at record levels, reserves exceeding liabilities by billions of dollars, Treasury exposure at historic highs, and strong risk management, Tether enters 2026 with one of the strongest balance sheets of any global company,\" said Paolo Ardoino, CEO of Tether, in a statement.The latest report comes amid rising global demand for stablecoins, with Tether’s USDT remaining the dominant digital dollar in circulation. Earlier this week, Tether launched USAT — a new stablecoin tailored for the U.S. market — in partnership with Anchorage Digital, a U.S.-based federally chartered crypto bank. The move marks a bid to carve out regulatory-compliant ground in the U.S.", "tags": ["Tether", "USDT", "Gold"]}
{"topic": "business", "art_add": "https://www.coindesk.com/business/2026/01/30/visa-and-mastercard-aren-t-buying-the-stablecoin-hype-for-everyday-payments", "art_title": "Visa and Mastercard aren’t buying the stablecoin hype for everyday payments", "discribtion": "Despite crypto’s promise of faster, cheaper transactions, the payments giants aren’t buying the stablecoin pitch, at least not in developed markets.", "writer": "Helene Braun", "time": "Jan 30, 2026, 5:44 p.m.", "what_to_know": "Visa and Mastercard executives told investors they see little current product-market fit for stablecoins in everyday consumer payments, especially in digitally developed markets. Both card networks are experimenting with blockchain and stablecoin settlement but view most crypto activity today as trading and speculation rather than a near-term threat or opportunity to their core businesses. Despite their caution, onchain activity is growing rapidly, with bitcoin settling more value than Visa and Mastercard combined, while SoFi is pushing ahead on crypto as part of a broader strategy to pair blockchain innovation with bank-grade stability.", "text": "Wall Street’s payments giants are not sold on crypto’s usefulness in everyday transactions — at least not yet.In earnings calls this week, both Visa and Mastercard executives offered cautious assessments of digital assets, especially stablecoins, signalling that consumer demand hasn't necessarily materialized in meaningful ways.“As I’ve said before, in the U.S., if a consumer wants to pay for something using a digital dollar, they have ample ways to do that today,” said Visa CEO Ryan McInerny. “They can pay from their checking account or their savings account. It’s become quite easy to do. So we don’t see a lot of product market fit for stablecoin payments and consumer payments in digitally developed markets.”Stablecoins are meant to make payments faster by allowing money to move directly between parties on a blockchain, without going through banks or card networks. Unlike traditional payments, which can take days to settle, especially across borders, stablecoin transactions can clear in seconds and operate around the clock, including weekends and holidays.In a September report, JP Morgan described stablecoins as “a digital, on-chain form of fiat money” that are “easy to self-custody and transact” and “fast, particularly in the context of cross-border money movement.” The bank said stablecoins could even be “a better form than fiat” in some situations, thanks to lower costs and around-the-clock settlement.But the report also warned of risks, including the potential for a destabilizing run on stablecoins. “The collapse of TerraUSD in May 2022 highlights just how quickly a run can occur, in an asset class that trades 24/7,” analyst Joyce Ho wrote.Mastercard struck a more open tone than Visa, with CEO Michael Mierbach saying the company is \"leaning in\" to emerging technologies like stablecoins and AI-powered agents but even he framed the company's role more as enabling infrastructure than leading transformation.“For us, stablecoins are another currency we can support within our network,” Miebach said. He pointed to work with MetaMask, Ripple and Gemini, but emphasized that the current dominant use case remains trading, not payments.\"We've made good traction enabling the purchase of these assets, facilitating transactions, and supporting stablecoins for settlement over our network,\" he said. Both companies have dabbled in blockchain infrastructure — Mastercard with pilots for on-chain identity and settlement tools, and Visa with experiments in stablecoin settlement using USDC. But despite these efforts, neither is treating crypto as a near-term threat or opportunity for their core businesses.That stance contrasts with the scale of on-chain activity. According to data from Glassnode, bitcoin alone settled over $25 trillion worth of transactions in 2025, more than Visa ($17 trillion) and Mastercard ($11 trillion) combined. While Bitcoin’s volume includes high-frequency and large institutional transfers, the size reflects growing blockchain demand across financial applications.Meanwhile, SoFi, the digital bank and fintech firm, is leaning into crypto more aggressively.After beating Wall Street estimates in its fourth-quarter earnings, SoFi’s stock rose briefly before dropping, now 5% lower.Just over 63,000 accounts were actively buying, selling, and holding digital assets in the fourth quarter of 2025, although the option only became fully available in late December. Nevertheless, the company said it sees crypto as part of a larger strategy.CEO Anthony Noto told investors that SoFi is “moving with urgency to lead the next phase of financial services by delivering crypto and blockchain innovation backed by bank-grade stability and security.”", "tags": ["Visa", "Mastercard"]}
{"topic": "business", "art_add": "https://www.coindesk.com/business/2026/01/30/xrp-linked-ripple-rolls-out-treasury-platform-after-usd1-billion-gtreasury-deal", "art_title": "XRP-linked Ripple rolls out treasury platform after $1 billion GTreasury deal", "discribtion": "New product lets companies manage cash, stablecoins and tokenized funds in one system, cutting cross-border settlement times from days to seconds.", "writer": "Shaurya Malwa", "time": "Jan 30, 2026, 12:44 p.m.", "what_to_know": "Ripple has launched Ripple Treasury, an enterprise platform that lets companies manage traditional cash and digital assets in one system, following its $1 billion acquisition of GTreasury. The service uses Ripple’s RLUSD stablecoin to move money across borders in three to five seconds, while integrating with existing treasury workflows to streamline liquidity and reduce idle capital. By connecting clients to overnight repo markets and tokenized money-market funds such as BlackRock’s BUIDL, Ripple aims to position itself as regulated institutional financial infrastructure rather than a crypto-only payments provider.", "text": "Blockchain-based payments firm Ripple launched a new enterprise product, Ripple Treasury, earlier this week that's aimed at helping companies manage traditional cash and digital assets within a single system, following its $1 billion acquisition of treasury software firm GTreasury last year.The platform allows corporate finance teams to move money across borders using Ripple’s RLUSD stablecoin, settling payments in three to five seconds instead of the three to five business days typical for bank wires. Ripple says the system is designed to reduce idle capital and simplify liquidity management for global firms.Ripple Treasury integrates directly with corporate treasury workflows through APIs, pulling balances and transactions from digital asset platforms into the same dashboards used for cash, debt and short-term investments. The idea is to let firms treat crypto rails as an extension of their existing banking infrastructure, rather than a separate system managed manually.Beyond payments, the platform connects users to overnight repo markets and tokenized money-market funds, including BlackRock’s BUIDL. That allows companies to earn yield on excess cash around the clock, instead of parking funds in bank accounts that stop operating outside business hours.The launch marks Ripple’s first major product release since acquiring Chicago-based GTreasury in October, a deal that brought decades of enterprise treasury experience into the company. Ripple is also leaning on infrastructure from Hidden Road, the prime brokerage it bought last year, to provide access to short-term funding markets.", "tags": []}
{"topic": "business", "art_add": "https://www.coindesk.com/business/2026/01/30/latin-america-s-largest-crypto-friendly-fintech-nubank-secures-u-s-banking-approval", "art_title": "Latin America’s biggest digital bank just won a key battle to offer crypto custody in U.S.", "discribtion": "The Brazilian digital bank announced it received conditional OCC approval to provide deposit accounts, credit cards, lending and digital asset custody in the United States.", "writer": "Olivier Acuna", "time": "UpdatedJan 30, 2026, 5:16 p.m.", "what_to_know": "Nu, Latin America's largest digital bank, has received conditional approval from the U.S. Office of the Comptroller of the Currency to open a branch in the United States. Once fully approved, Nubank plans to offer deposit accounts, credit cards, lending and digital asset custody services under a comprehensive federal banking framework. Before launching, Nubank must satisfy OCC conditions, secure approvals from the FDIC and Federal Reserve, fully capitalize the institution within 12 months and open the bank within 18 months.", "text": "Latin America's largest digital bank has taken steps toward being able to offer crypto custody in the U.S.São Paulo-based Nu (NYSE: NU), which has 127 million customers, has received conditional approval from the U.S. Office of the Comptroller of the Currency (OCC) to branch in the United States, the bank announced on ThursdayNubank said that once fully approved, the OCC would allow it to operate under a comprehensive federal framework, facilitating the launch of deposit accounts, credit cards, lending, and digital asset custody. It also said it has already begun working to establish hubs in Miami, the San Francisco Bay Area, Northern Virginia, and the North Carolina Research Triangle.The approval comes as U.S. regulators signal a shift from enforcement-first oversight to broader supervision of crypto banking with the OCC publicly acknowledging that crypto “debanking” is a real concern and defending broader access for digital asset firms. It also highlights that fact that federally regulated institutions may soon offer crypto services under mainstream banking frameworksThe next steps for Nubank, while it receives the final green light, involve meeting specific OCC conditions and obtaining pending approvals from the Federal Deposit Insurance Corporation (FDIC) and the Federal Reserve. During this phase, the company will focus on fully capitalizing the institution within 12 months and opening the bank within 18 months, as required by U.S. regulators.", "tags": ["Nubank", "OCC", "banks", "Crypto Custody"]}
{"topic": "business", "art_add": "https://www.coindesk.com/business/2026/01/30/vitalik-buterin-withdraws-usd17-million-in-eth-as-ethereum-foundation-enters-mild-austerity", "art_title": "Vitalik Buterin to spend $43 million on Ethereum development", "discribtion": "Ethereum’s co-founder said the $43 million withdrawal will support a broader “full-stack openness and verifiability” vision as the foundation tightens spending.", "writer": "Oliver Knight", "time": "UpdatedJan 30, 2026, 5:35 p.m.", "what_to_know": "Vitalik Buterin withdrew 16,384 ETH, worth about $43 million at current prices, to deploy toward open-source security and privacy projects. The move comes as the Ethereum Foundation enters a period of “mild austerity” following a market drawdown. The foundation still holds roughly $558 million in crypto assets, according to Arkham.", "text": "Ethereum co-founder Vitalik Buterin said the Ethereum Foundation (EF) is entering a period of “mild austerity,” as it seeks to deliver an aggressive scaling roadmap while ensuring it can sustain itself over the long term.In a post on X, Buterin said he has personally withdrawn 16,384 ETH, worth roughly $43 million at current market prices, to support a broader effort to build an open-source, secure and verifiable “full stack” of software and hardware.Ether ETH$2,688.23 was trading around $2,720 on Tuesday, down significantly from its October peak near $4,831, as crypto markets have pulled back in recent weeks.Buterin framed the initiative as extending beyond Ethereum itself, with potential applications across finance, communications, governance, operating systems and secure hardware. He also pointed to emerging areas such as biotech and public health, alongside privacy-preserving tools like encrypted messaging and local-first software.The Ethereum Foundation will remain focused on developing the blockchain, Buterin said, but with an emphasis on “Ethereum for people who need it” — prioritizing decentralization, self-sovereignty, privacy and security over corporate adoption.Buterin also said he is exploring decentralized staking options that could generate additional funding through staking rewards over time.The announcement comes as the Foundation holds about $558 million worth of crypto assets, according to blockchain analytics firm Arkham. Vitalik, meanwhile, holds $666 million.", "tags": ["Ethereum Foundation", "Vitalik Buterin", "Ethereum News"]}
{"topic": "business", "art_add": "https://www.coindesk.com/business/2026/01/29/tokenization-firm-securitize-reports-841-revenue-growth-as-it-prepares-to-go-public", "art_title": "Tokenization firm Securitize reports 841% revenue growth as it prepares to go public", "discribtion": "With crypto prices and crypto-related stocks in the midst of a major selloff today, Securitize SPAC merger partner Cantor Equity Partners II is higher by 4.4% on the news.", "writer": "Krisztian Sandor", "time": "UpdatedJan 29, 2026, 9:33 p.m.", "what_to_know": "Securitize continued toward an ultimate public listing via a SPAC merger with Cantor Equity Partners II (CEPT). The company reported an 841% year-over-year increase in revenue to $55.6 million for the nine months ended September 2025. CEPT stock gained 4.4%, outperforming sharply lower crypto markets.", "text": "Tokenization firm Securitize has filed a public registration statement with the SEC, moving forward with plans to go public through a merger with Cantor Fitzgerald-backed black check company Cantor Equity Partners II (CEPT).In the Wednesday filing, the company reported $55.6 million in revenue for the first nine months of 2025, an 841% increase from the same period in 2024. Full-year 2024 revenue came in at $18.8 million, more than double that of the year before.While most crypto-linked stocks were seeing steep 5%-10% drawdowns as bitcoin and tech stocks sold off Thursday, CEPT was 4.4% higher late in the session.Securitize provides infrastructure to turn traditional assets — like U.S. Treasuries, funds or equity— into tokens on blockchain rails that can be issued, traded or managed more efficiently. The merger deal with CEPT still needs shareholder and regulatory approval. If cleared, Securitize would begin trading on Nasdaq as a public company under the SECZ ticker.The deal comes as tokenization is gaining traction across traditional finance. Global banks and asset managers like JPMorgan and BlackRock increasingly include tokenized assets in their offerings, and a report by Boston Consulting Group and Ripple estimated the market could grow to $18.9 trillion by 2033.", "tags": ["Tokenization", "Securitize", "Cantor fitzgerald"]}
{"topic": "business", "art_add": "https://www.coindesk.com/business/2026/01/29/aero-dex-aims-to-fix-liquidity-fragmentation-and-dethrone-the-incumbents", "art_title": "Aero DEX aims to fix liquidity fragmentation and dethrone the incumbents", "discribtion": "The rollout of Aero, targeted for the second quarter of 2026, will take direct aim at incumbents like Uniswap and Curve, the team told CoinDesk.", "writer": "Margaux Nijkerk", "time": "UpdatedJan 30, 2026, 7:33 p.m.", "what_to_know": "While much of the industry’s attention over the past year has gravitated toward stablecoins, tokenized treasuries and institutional onramps, the team behind Velodrome and Aerodrome says the real power struggle in crypto is unfolding elsewhere: in decentralized exchanges (DEXs). The team is getting ready to unveil Aero,a unified DEX that will mergeits existing Aerodrome and Velodrome protocols under a single operating system, hoping to take direct aim at incumbents like Uniswap and Curve.", "text": "While much of the industry’s attention over the past year has gravitated toward stablecoins, tokenized treasuries and institutional onramps, the team behind Velodrome and Aerodrome says the real power struggle in crypto is unfolding elsewhere: in decentralized exchanges (DEXs).Alex Cutler, the CEO of Dromos Labs, the main developer firm behind Aerodrome and Velodrome, described the exchange layer as \"the second most important layer\" to the onchain economy in an interview with CoinDesk.That view is now shaping the company’s most aggressive move yet. Dromos Labs is preparing to unveil Aero, a unified DEX that will merge its existing Aerodrome and Velodrome protocols under a single operating system, and take direct aim at incumbents like Uniswap and Curve.The rollout, targeted for the second quarter of 2026, will also mark Dromos Labs’ expansion to Ethereum mainnet, putting the firm into head-to-head competition with the largest and most entrenched DEXs in the market.Aerodrome currently captures a significant share of trading activity on Coinbase’s Base network, while Velodrome plays a similar role across Optimism’s Superchain. Aerodrome currently has nearly $500 million in total value locked (TVL) and surpassed $1 billion in December 2025, when it accounted for roughly a quarter of Base’s total TVL, a level of dominance Dromos Labs says is repeatable on mainnet.While decentralized finance may no longer dominate crypto’s daily headlines, Cutler argues that it reflects consolidation, not stagnation. In his view, nearly every narrative driving crypto adoption, from institutional FX to memecoins, still depends on the same foundational infrastructure.“You can’t have global FX onchain without deep liquidity and the ability to exchange it freely, cross-network, at fast speeds and low cost,” he said. “The two essential pillars of the onchain economy are the chain layer and the exchange layer — and every trend benefits those two.”Dromos Labs’ strategy is rooted in the belief that exchanges, rather than blockchains, will become the primary footholds for value as more assets move onchain. That thesis informs both Aero’s design and the company’s increasingly explicit positioning against Uniswap, the sector’s largest incumbent.“One of the most important stories next year is going to be: who owns the exchange layer?” Cutler said.The competitive contrast sharpened earlier this year when Uniswap governance advanced a “UNIfication proposal” aimed at allowing protocol revenue to flow to UNI token holders. Cutler publicly criticized the move, arguing it weakens Uniswap’s relationship with liquidity providers, the core engine of any DEX.“They’re taking from liquidity providers to give to token holders — and that means paying less for the most essential service in DeFi,” he said.(The UNIfication proposal is Uniswap’s approved plan to simplify how the protocol works and begin redirecting some of its trading fees from liquidity providers to the protocol.)Uniswap did not return a request for comment in time for publication. Until now, Dromos Labs’ competitiveness has largely been confined to layer-2 networks. Aero’s Ethereum mainnet launch is intended to change that dynamic, and test whether its model can scale against Uniswap and Curve on their home turf.While Aero is designed to serve retail users chasing liquidity across networks, Dromos Labs is also building with institutional adoption in mind.“Institutions will use DeFi rails, but those rails have to be institutional-grade, that’s non-negotiable,” Cutler said. “There can’t be human dependency layers. Everything has to be verifiable.”That includes onchain automation, reduced operational risk and compliance tooling embedded directly at the protocol level, features Cutler says are essential as capital markets increasingly move onchain.Read more: Leading Base DEX Aerodrome Merges Into Aero in Major Overhaul", "tags": ["Base", "Optimism foundation", "DEX", "Decentralized exchange", "Ethereum News", "Uniswap"]}
{"topic": "business", "art_add": "https://www.coindesk.com/business/2026/01/29/ethereum-ogs-revive-the-dao-with-usd220-million-security-fund-unchained-reports", "art_title": "Ethereum OGs revive the DAO with $220 million security fund, Unchained reports", "discribtion": "According to the report, $13.5 million will be allocated to security grants distributed through DAO-style mechanisms", "writer": "Margaux Nijkerk", "time": "UpdatedJan 29, 2026, 5:20 p.m.", "what_to_know": "Some key Ethereum members, including Ethereum co-founder Vitalik Buterin, are reviving one of the network’s oldest and most symbolic chapters: The DAO. According to the announcement, $13.5 million will be allocated to security grants distributed through DAO-style mechanisms.", "text": "Some key Ethereum members, including co-founder Vitalik Buterin, are reviving one of the network’s oldest and most symbolic chapters: The DAO (decentralized autonomous organization).More than 70,500 ether ETH$2,688.23 that have sat untouched since the 2016 DAO hack — long considered Ethereum’s defining existential crisis — will be redeployed into a roughly $220 million Ethereum security initiative, Unchained reported.According to the report, $13.5 million will be allocated to security grants distributed through DAO-style mechanisms including quadratic funding, retroactive public goods funding, ranked-choice RFPs and other governance processes under a new entity, The DAO Fund.The remaining 69,420 ETH will be staked to generate an endowment for Ethereum security efforts. The investment is expected to yield roughly $8 million annually at current rates.The DAO was an experiment in decentralized governance built on the Ethereum blockchain. It was designed as a fully autonomous vehicle where token holders could vote on proposals and allocate capital without traditional intermediaries, an idea that captured widespread excitement and drew one of the largest crowdsales in crypto historyBut within months, a flaw in The DAO’s smart contract code allowed an attacker to drain $60 million worth of ether ETH$2,688.23 at the time, in what became one of blockchain’s earliest and most high-profile exploits. The breach sparked a bitter community debate over how to respond, ultimately leading to a contentious splitting of the network, known in blockchain parlance as a hard fork.The hard fork also split the community, with those who rejected the rollback thus continued on the original chain, now known as Ethereum Classic, while the mainline chain carried on as today’s Ethereum.The incident not only shaped Ethereum’s early governance and security norms but became a cautionary touchstone for smart contract audits, decentralized governance design and crypto’s philosophical debates over immutability versus intervention — themes that still resonate in the space today.Fast forward to today, the move marks a symbolic and practical return to DAO-based coordination nearly a decade after the original experiment fractured the community and led to Ethereum’s historic hard fork.“TheDAO is back,” the project wrote on X. “A decade later, we’re opening a new chapter”", "tags": ["Ethereum Foundation", "Ethereum News", "DAOs"]}
{"topic": "business", "art_add": "https://www.coindesk.com/business/2026/01/26/crypto-custody-firm-copper-in-early-talks-for-ipo-as-crypto-plumbing-becomes-new-wall-street-favorite", "art_title": "Crypto custody firm Copper in early talks for IPO as crypto 'plumbing' becomes new Wall Street favorite", "discribtion": "The London-based custody provider is weighing a potential public listing, aiming to follow rival BitGo's recent IPO.", "writer": "Will Canny", "time": "Jan 29, 2026, 3:55 p.m.", "what_to_know": "Copper is evaluating a public listing, though a final decision will hinge on near-term revenue targets, according to sources. Goldman Sachs, Citi and Deutsche Bank are said to be among the investment banks potentially involved. The move follows the $2 billion IPO of competitor BitGo last week, signaling a market shift away from speculative tokens toward the financial plumbing of digital assets.", "text": "Crypto custody firm Copper is in early talks about a public listing, according to three people with knowledge of the matter.Goldman Sachs, Citi and Deutsche Bank are among the investment banks potentially involved, according to one source.The decision on whether to pursue a listing will hinge on the company’s near-term revenue performance, a second person said, who spoke on condition of anonymity as the matter is private.\"As standard practice, Copper regularly assesses a range of potential financing options to support the business and our clients, but we are not planning an IPO,” a Copper spokesperson said in emailed comments. However, the spokesperson declined to comment on whether the company is currently engaged in early talks about a potential listing.Goldman Sachs, Citi and Deutsche Bank did not respond to requests for comment by publication time.Copper has joined the growing wave of digital asset firms eyeing public markets, becoming the latest crypto-native player to weigh an IPO. The move follows a high-profile debut by rival custody provider BitGo (BTGO), which listed on the New York Stock Exchange last week at $18 per share.BitGo’s offering achieved an initial market valuation of approximately $2 billion, setting a fresh benchmark for the firms that provide plumbing or infrastructure for the financial industry. On its first day of trading, the stock surged 36% before closing the session at $18.49. Since that initial spike, the stock has faced significant downward pressure. The shares were trading around $12.50 at publication time, falling about 30% from the IPO price.After years on the sidelines, the cryptocurrency industry finally broke through the IPO ceiling in 2025, transforming from a speculative frontier into a mainstay of public markets.Driven by a surge in regulatory clarity and a pro-crypto stance from the Securities and Exchange Commission (SEC), major firms, including Circle (CRCL), CoinDesk's owner Bullish (BLSH), and Gemini (GEMI), successfully debuted in the public market. According to Pitchbook data, at least 11 crypto IPOs raised a combined $14.6 billion in 2025, a massive leap from the mere $310 million raised in 2024. While the year was defined by the arrival of these blockbuster listings, performance remained a tale of two markets. Institutional-grade infrastructure plays saw shares soar as much as 200% on their opening days, while others, like the Winklevoss-led Gemini, struggled under the weight of post-debut volatility, ending the year significantly below their offer prices.If 2025 was dominated by listings tied to digital asset treasuries (DATs), 2026 is shaping up to look more like a year of financial infrastructure, White & Case partner Laura Katherine Mann told CoinDesk in an interview. She expects the next wave of IPO candidates to emphasize compliance maturity, recurring revenue and operational resilience, attributes more familiar to public-market investors.Copper fits that profile. The company provides institutional-grade crypto infrastructure, including custody built on multi-party computation (MPC) technology, as well as settlement and prime brokerage services designed to reduce counterparty risk for banks and trading firms.The custody firm appointed Tammy Weinrib as chief compliance officer and Bank Secrecy Act officer for the Americas in March last year, as part of its expansion in the region. Her appointment followed that of Amar Kuchinad as global CEO in October 2024.Read more: Copper Hires Tammy Weinrib as Chief Compliance Officer for Americas as it Expands in U.S.", "tags": ["Copper", "Crypto Custody", "IPO", "Exclusive "]}
{"topic": "business", "art_add": "https://www.coindesk.com/business/2026/01/29/dubai-sees-first-insurance-firm-issued-crypto-wallet-for-premiums-and-claims", "art_title": "Dubai Insurance offers a crypto wallet so you can pay premiums and collect claims in bitcoin", "discribtion": "In partnership with Standard Chartered’s Zodia Custody, Dubai Insurance is the first insurer globally to issue a crypto wallet for its policy holders to transact with digital assets.", "writer": "Olivier Acuna", "time": "Jan 29, 2026, 3:32 p.m.", "what_to_know": "Dubai Insurance has become the first traditional insurer globally to launch a cryptocurrency wallet for customers to pay premiums, receive claims and transact digital assets. The wallet, developed with Standard Chartered–backed Zodia Custody, aligns with the United Arab Emirates’ push to integrate digital assets into mainstream finance under clearer regulatory rules. Executives say the move introduces regulated, on-chain infrastructure to the regional insurance sector, aiming to improve transparency, efficiency and customer experience while maintaining strict governance and security standards.", "text": "Dubai Insurance became the first in its sector on a global scale to roll out a cryptocurrency wallet for its customers to handle claims and premiums, and transact digital assets.The fourth-largest insurer in the United Arabs Emirates (UAE)said it developed the crypto wallet in partnership with Standard-Chartered-owned crypto custodian Zodia Custody, in an emailed announcement on Wednesday.Dubai Insurance’s venture into digital assets comes as the UAE increasingly pushes forward the integration of digital assets into mainstream financial services and as traditional firms (TradFi) experiment with blockchain-based payments amid clearer rules for custody and compliance. It also comes months after the country enacted a new central bank law that brought digital assets and decentralized finance (DeFi) into traditional banking regulatory compliance, positioning the country as a global financial innovation hub.While crypto wallets are increasingly common among TradFi firms such as PayPal Robinhood and Revolut, their adoption by a regulated insurer signals a deeper shift in how legacy financial institutions are testing onchain infrastructure for real-world transactions.“By becoming the first insurance company to enable the receipt of premiums and payment of claims in digital assets through a secure digital wallet, we are redefining how insurance services are delivered while remaining firmly aligned with regulatory and governance frameworks,” said Abdellatif Abuqurah, CEO at Dubai Insurance.The move by the UAE firm introduces a regulated infrastructure that allows policyholders to transact using digital assets, while ensuring high standards of security, governance, and transparency.", "tags": ["Dubai", "United Arab Emirates", "crypto wallet", "Zodia Custody"]}
{"topic": "business", "art_add": "https://www.coindesk.com/business/2026/01/29/robinhood-is-investing-in-crypto-trading-platform-talos-at-usd1-5-billion-valuation", "art_title": "Robinhood is investing in crypto trading platform Talos at $1.5 billion valuation", "discribtion": "The $45 million Series B extension also includes participation from new strategic investors Sony Innovation Fund, IMC, QCP and Karatage.", "writer": "Will Canny", "time": "UpdatedJan 29, 2026, 2:02 p.m.", "what_to_know": "Robinhood is investing in Talos in an extended Series B funding round valuing the firm at about $1.5 billion. Talos provides institutional-grade crypto trading infrastructure, serving hundreds of clients globally and asset managers representing roughly $21 trillion in AUM. The round highlights growing demand for crypto market infrastructure, as Robinhood deepens its blockchain strategy and Talos continues to scale through M&A.", "text": "Robinhood (HOOD) is investing in Talos, an institutional trading technology provider for digital assets, in an extended Series B funding round that values the New York-based company at around $1.5 billion.Talos originally raised $105 million in a Series B funding round in May 2022, valuing the firm at $1.25 billion. The new extension brings the firm's total amount raised in its Series B to $150 million, the company said in a press release on Thursday. \"We extended our series B round to accommodate interest from strategic partners who recognize Talos’s role in providing core institutional infrastructure for digital assets. At a time when traditional asset classes are increasingly migrating to digital rails, these partners wanted to be more closely aligned with our growth,\" said Anton Katz, CEO and co-founder of Talos, in emailed comments.New strategic investors Robinhood Markets, Sony Innovation Fund, IMC, QCP, and Karatage joined the extended round, alongside returning backers a16z crypto, BNY and Fidelity Investments.\"Talos’s flexibility and rapid adaptability allow us to deepen our liquidity and deliver even more advanced features to Robinhood Crypto customers,” said Johann Kerbrat, SVP and GM of Crypto at Robinhood, in the release. Robinhood has been expanding its reach in crypto and blockchain infrastructure as part of its broader expansion strategy. The company is developing its own blockchain network built on Arbitrum and has rolled out tokenized stock trading and other crypto products in Europe, alongside new staking and perpetual futures offerings, signaling a shift toward crypto-native finance. It has also seen strong growth in areas such as prediction markets, and recently reported increased trading volumes and product engagement amid these strategic investments.Talos is a crypto trading technology firm that builds institutional-grade infrastructure to power the entire digital asset trading lifecycle for professional investors, brokers and banks. Its platform pools liquidity from exchanges, over-the-counter (OTC) desks and prime brokers, and provides institutions with tools for trade execution, risk management and post-trade settlement through a single interface or API.It counts hundreds of clients across roughly 35 countries, with traditional finance firms making up 60% to 70% of new customers over the past year. Asset managers using Talos' platform collectively represent about $21 trillion in assets under management, CEO Anton Katz told investment bank Jefferies in a client call in November.The firm's Series B in 2022 was led by General Atlantic, with participation from firms including BNY, Citi (C), Wells Fargo Strategic Capital and DRW Venture Capital, alongside crypto-focused investors such as SCB 10x and LeadBlock Partners. Existing backers, including Andreessen Horowitz, PayPal Ventures, Fidelity Investments and Castle Island Ventures, also participated in the round.Talos has been on a notable acquisition spree, most recently buying Coin Metrics for over $100 million, bringing in its onchain analytics, market data and benchmark indexes as its largest deal yet. Before that, it snapped up D3X Systems, Cloudwall, and Skolem as part of its broader expansion through M&A.Read more: Tether said to have invested up to $50 million in crypto lender Ledn at $500 million valuation", "tags": ["Robinhood", "Talos", "Fundraising", "Crypto Trading", "Exclusive "]}
{"topic": "business", "art_add": "https://www.coindesk.com/business/2026/01/29/sygnum-bank-and-starboard-raise-over-750-btc-for-market-neutral-bitcoin-yield-fund", "art_title": "Sygnum’s new bitcoin fund pulls in $65 million from investors looking for steady yield", "discribtion": "The fund delivered an 8.9% annualized net return in its first quarter, targeting 8-10% annual returns through systematic arbitrage strategies.", "writer": "Francisco Rodrigues", "time": "Jan 29, 2026, 12:20 p.m.", "what_to_know": "Sygnum Bank and Starboard Digital raised over 750 bitcoin (worth $65 million) for the BTC Alpha Fund, a market-neutral investment vehicle. The fund delivered an 8.9% annualized net return in its first quarter, targeting 8-10% annual returns through systematic arbitrage strategies. Shares in the fund are eligible as collateral for Lombard loans through Sygnum, enabling investors to unlock liquidity without selling their bitcoin positions.", "text": "Swiss digital asset bank Sygnum Bank and Starboard Digital have raised over 750 bitcoin BTC$83,642.21, worth more than $65 million at current prices, for its BTC investment vehicle.The BTC Alpha Fund, offered by Sygnum in partnership with Starboard, is designed to generate yield on its bitcoin holdings without relying on price increases.The Cayman Islands-domiciled fund delivered an 8.9% annualized net return in its first full quarter following its debut in October last year. It targets 8-10% annual BTC-denominated returns by capturing price differences between spot and derivative markets.The fund avoids uses systematic arbitrage strategies, meaning it takes advantage of glitches in the prices of assets on different exchanges to try and produce steady returns irrespective of market conditions.The strong early inflows point to rising demand among institutional investors for bitcoin strategies that generate income while maintaining long-term exposure, according to Markus Hämmerli, Sygum's head of portfolio management.The fund is open to professional investors in jurisdictions including Switzerland and Singapore.Shares in the fund are also eligible as collateral for Lombard loans through Sygnum, enabling investors to unlock liquidity without selling their bitcoin positions.Sygnum earlier this year teamed up with bitcoin lending startup Debifi to launch what the companies said was the first bank-backed loan platform that didn’t require borrowers to give up control of their BTC.", "tags": ["Sygnum Bank", "Bitcoin News"]}
