{"topic": "markets", "art_add": "https://www.coindesk.com/markets/2026/01/30/spacex-tesla-merger-talks-puts-nearly-20-000-bitcoin-in-focus", "art_title": "SpaceX-Tesla merger talks puts nearly 20,000 bitcoin in focus", "discribtion": "Any deal involving SpaceX and Tesla would quietly consolidate one of the world’s largest corporate bitcoin holdings under a single roof.", "writer": "Shaurya Malwa", "time": "Jan 30, 2026, 11:30 p.m.", "what_to_know": "Elon Musk’s exploration of a potential merger involving SpaceX, Tesla or xAI is drawing attention to the companies’ combined holdings of nearly 20,000 bitcoin, worth about $1.7 billion. A merger would consolidate one of the world’s largest corporate bitcoin positions under a single structure, raising questions about governance, accounting treatment and investor scrutiny as bitcoin prices remain volatile. The talks come as SpaceX weighs a possible IPO and as Tesla’s uneven history with bitcoin, including large purchases, sales and recent losses under fair-value accounting rules, continues to shape investor perceptions of Musk-linked crypto exposure.", "text": "Elon Musk’s consideration of a potential merger involving SpaceX, Tesla or artificial intelligence firm xAI has put renewed attention on a lesser-discussed piece of his empire: one of the largest corporate bitcoin holdings in the world.SpaceX and Tesla together hold nearly 20,000 bitcoin, according to public disclosures, a stash worth roughly $1.7 billion at current prices. That would make the entity the world's seventh largest BTC holder, just behind CoinDesk-owner Bullish's 24,300 BTC.While any deal remains preliminary and could still fall apart, a combination would concentrate that exposure under a single corporate structure at a time when bitcoin prices are once again volatile and investor scrutiny is high.SpaceX has held bitcoin since early 2021 and currently controls about 8,285 BTC, worth roughly $680 million. Tesla, meanwhile, holds 11,509 BTC, valued near $1 billion, and reported no changes to that position in the fourth quarter of 2025. The electric vehicle maker booked a $239 million after-tax loss on its digital assets last quarter as bitcoin slid from around $114,000 to the high $80,000s.A merger would not change bitcoin’s fundamentals, but it would reshape how one of the largest corporate positions is governed, accounted for and potentially financed. Tesla is a public company subject to fair-value accounting rules, meaning swings in bitcoin prices flow directly through earnings. SpaceX, still private, has so far avoided that kind of quarter-to-quarter visibility.That difference matters as SpaceX weighs a possible IPO that could value the company near $1.5 trillion. Crypto exposure, even if passive, becomes part of the due diligence process for large institutional investors, some of whom remain cautious about digital assets on corporate balance sheets.Tesla’s past dealings with bitcoin still loom large. The company disclosed a $1.5 billion purchase in early 2021, sold a portion shortly afterward, then unloaded roughly 75% of its holdings in 2022 near bear-market lows. TThe episode pinned Tesla’s reputation as a high-profile but inconsistent corporate holder, making any renewed focus on Musk-linked bitcoin treasuries more sensitive.As such, neither company has signaled plans to buy or sell bitcoin as part of the merger discussions, and the holdings represent a small fraction of daily trading volumes. Still, corporate concentration matters at the margins, particularly as bitcoin’s narrative as a balance-sheet asset faces renewed debate amid gold’s surge and broader risk-off flows.Whether SpaceX ultimately merges with Tesla, pairs with xAI or stays independent, the talks highlight how bitcoin has quietly become embedded inside some of the world’s most valuable technology firms. Even when bitcoin isn’t the headline, it remains on the balance sheet — and that alone is enough to keep investors watching.", "tags": ["Elon Musk", "Tesla", "Why is bitcoin up"]}
{"topic": "markets", "art_add": "https://www.coindesk.com/markets/2026/01/30/bitwise-cio-matt-hougan-says-bitcoin-could-hit-usd6-5-million-in-20-years", "art_title": "Bitwise CIO Matt Hougan says bitcoin could hit $6.5 million in 20 years", "discribtion": "After a bruising 2025, Hougan sees sideways Bitcoin trading, rising institutional interest and early central bank curiosity setting up the next cycle.", "writer": "AI Boost", "time": "Jan 30, 2026, 7:54 p.m.", "what_to_know": "Crypto spent much of 2025 in a bear market, with many altcoins down more than 60%, Hougan said. Bitcoin avoided steeper losses largely due to sustained buying from corporations and ETFs, according to Hougan. He described current conditions as a “rounding bottom” marked by weak ETF flows and muted retail participation.", "text": "Where bitcoin trades from here: Expect patience before the next leg higher.Why precious metals matter: Gold’s rally reinforces bitcoin’s long-term case.Central banks are circling, slowly: Interest is rising, but adoption is years away.The $6.5 million bitcoin call: A long-term bet on monetary reality.Zooming out: Volatility compression is key for institutions.Final take: Short-term chop, long-term conviction.Watch the full interview.", "tags": ["btc", "Bitwise", "Bitwise Asset Management", "Gold"]}
{"topic": "markets", "art_add": "https://www.coindesk.com/markets/2026/01/30/anatomy-of-bitcoin-s-plunge-this-week-the-dollar-s-bottom-was-btc-s-top", "art_title": "Anatomy of bitcoin's plunge this week: The dollar's bottom was BTC's top", "discribtion": "It seems like ages ago, but bitcoin rose to just shy of $91,000 on Wednesday. Then the U.S. dollar started to strengthen.", "writer": "James Van Straten", "time": "UpdatedJan 30, 2026, 8:34 p.m.", "what_to_know": "Bitcoin was actually posting gains this week as the U.S. dollar fell through a key technical level. That ended on Wednesday afternoon, though, as the Fed stood pat on policy and speculation about who the next Fed chair might be amped higher. The Thursday night leak of the nomination of Kevin Warsh caused a spike in the dollar and a fast decline in bitcoin.", "text": "Bitcoin’s BTC$83,642.21 sell-off late this week might have had little to do with crypto-specific factors and instead everything to do with the U.S. dollar.After what’s now becoming a customary weekend decline in crypto prices, bitcoin was actually on the rise through the week, in part as the decline in the U.S. dollar accelerated.Bitcoin peaked for the week late Wednesday afternoon, just shy of $91,000, as the Fed held rates steady and attention turned to who President Trump might nominate as the next leader of the U.S. central bank.The peak coincided with a decline in the dollar index (DXY) to a multi-year low of 95.34. All other things being equal, a weaker U.S. dollar is often seen as supportive of asset prices, such as bitcoin, stocks, and commodities.Even though technicians sounded the alarm that the DXY below 96 meant even deeper declines for the greenback, markets thought otherwise. The dollar began a steady climb, and, alongside, bitcoin began pulling back from that $91,000 level.The dollar continued strengthening into Thursday, with bitcoin's losses accelerating throughout the session. Finally, the Thursday evening leak that Kevin Warsh (and his hawkish reputation) was to be nominated as Fed chairman forced another surge higher in the dollar and gap lower in bitcoin, with BTC ultimately bottoming at $81,000.Bitcoin's managed to bounce to $83,000 since then, but the dollar has continued to post gains, raising questions about how sustainable the crypto's rise might be.", "tags": ["US Dollar", "Bitcoin News", "Federal Reserve"]}
{"topic": "markets", "art_add": "https://www.coindesk.com/markets/2026/01/30/precious-metals-crash-with-silver-plunging-32-gold-11-bitcoin-slips-back-to-usd82-000", "art_title": "Precious metals crash, with silver plunging 35%, gold falling 12% while bitcoin holds at $83,000", "discribtion": "Crypto bulls who have theorized that bitcoin can't begin rising until money flows out of red-hot precious metals are about to find out if they were correct.", "writer": "Krisztian Sandor", "time": "UpdatedJan 30, 2026, 7:04 p.m.", "what_to_know": "Gold and silver plunged sharply from record highs on Friday, with silver down more than 30% and gold down more than 10%. Bitcoin was making an attempt at holding steady, but remained not too far off of the week's low at $83,000. The metals rally siphoned capital out of crypto, but the dynamic is changing, Wincent director Paul Howard said.", "text": "The bubble in precious metals might have popped this week, with silver's violent decline on Friday leading the group lower.Having touched a new record of $120 per ounce earlier in the session, silver has pulled back to $75 in U.S. afternoon hours, now lower by 35% for the day. Gold — which as recently as Sunday had never seen $5,000 per ounce — climbed to $5,600 at one point Thursday, but has now retreated to $4,718, down 12% for the day.Platinum is lower by 24% and palladium by 20%.To put silver's move in perspective, it's given back nearly its entire massive January gain in the space of a few hours. While crypto bulls might be used to such action, only those precious metals traders who were around during the days of the Hunt Brothers in 1980 will be familiar with that sort of downside volatility.U.S. stocks are selling off as well, the Nasdaq down 1.25% and S&P 500 0.9%.After plunging earlier in the week, cryptocurrencies, by comparison, are moving somewhat sideways on Friday, holding above Thursday evening's panicky lows. Bitcoin was trading around $83,000 recently versus its overnight bottom of $81,000.The action in markets has been volatile all week, but this latest bout appears to have been set off by President Trump's picking Kevin Warsh to replace Jerome Powell as Federal Reserve chair. Conventional thinking at the moment says Warsh was a somewhat hawkish pick, thus perhaps setting off the selling in risk assets.Paul Howard, director at trading firm Wincent, spoke for many crypto bulls, saying the parabolic move in commodities in recent months had siphoned risk capital from crypto markets. That dynamic may now be shifting.\"Cryptocurrency markets have been the victim of risk capital flowing into the still popular commodities trade,\" he said. He noted growing interest in options markets for upside exposure in February, with the 105,000 BTC calls among the most actively traded contracts.\"The outlook indicates what a lot of crypto traders are feeling right now — that their market is long overdue a commodity-style catch-up,\" Howard added.“What was meant to be a bullish move for the markets appears to have coincided with a broad risk sell-off,” Howard said of the nomination of Kevin Warsh. “The reaction may be more of a knee-jerk as markets recalibrate.”", "tags": ["Market Wrap", "Bitcoin News", "top news", "Breaking News"]}
{"topic": "markets", "art_add": "https://www.coindesk.com/markets/2026/01/30/druckenmiller-on-warsh-as-fed-chair-no-one-better-equipped", "art_title": "Hedge fund billionaire Stan Druckenmiller on Warsh as Fed chair: ‘no one better equipped’", "discribtion": "The conventional wisdom on Trump's pick for Fed chair says he's a hawk. Stanley Druckenmiller, who made billions fading conventional wisdom, suggests that's not necessarily so.", "writer": "Stephen Alpher", "time": "UpdatedJan 30, 2026, 3:35 p.m.", "what_to_know": "Hedge fund billionaire Stan Druckenmiller told the FT he’s highly supportive of Trump’s pick of Kevin Warsh to lead the Fed. Druckenmiller has a very close relationship not only with Warsh but also with Treasury Secretary Scot Bessent. The branding of Warsh as always hawkish isn’t correct, said Druckenmiller.", "text": "The knee-jerk reaction to Donald Trump’s pick of Kevin Warsh to replace Jerome Powell as chairman of the Federal Reserve is that the president made the most hawkish selection among the four reported finalists for the job.In the wake of last night’s leak that Warsh was to be the choice, risk markets — crypto among them — fell sharply, with bitcoin plunging all the way back to $81,000.\"The branding of Kevin as someone who’s always hawkish is not correct,” Stanley Druckenmiller told the FT on Friday. \"I’ve seen him go both ways.\"Druckenmiller — who made billions working alongside George Soros at Quantum Fund and with his own family office, Duquesne Capital Management — is surely in a position to know. Warsh has been a partner at Duquesne since 2011. The relationship between them has previously been described as close to father-son, with the two speaking and/or texting more than a dozen times per day.\"I could not think of a single other individual on the planet better equipped,\" Druckenmiller continued.Druckenmiller also has very close ties to Scott Bessent. It was Druckenmiller who hired Bessent at Quantum Fund more than 30 years ago, where the to-be U.S. Treasury Secretary made his own billions.\"The pair [Bessent and Warsh] embody the way Druckenmiller interprets markets and economic policy,\" wrote the FT in a profile roughly one year ago.“I’m really excited about the partnership between [Warsh] and Bessent,” Druckenmiller said today. “Having an accord between the Treasury secretary and Fed chair is ideal.”", "tags": ["Federal Reserve"]}
{"topic": "markets", "art_add": "https://www.coindesk.com/markets/2026/01/30/bitcoin-ether-extend-declines-as-leverage-unwind-accelerates-crypto-markets-today", "art_title": "Bitcoin, ether extend declines as leverage unwind accelerates: Crypto Markets Today", "discribtion": "Crypto markets fell further overnight as bitcoin and ether extended losses, metals tumbled and liquidation pressure hit leveraged traders across derivatives markets.", "writer": "Oliver Knight", "time": "Jan 30, 2026, 11:30 a.m.", "what_to_know": "Bitcoin and ether extended declines as the crypto market compounded Thursday's selloff. Silver and gold also fell, adding to broader market weakness alongside a firmer dollar. Crypto liquidations hit $1.8 billion, while bitcoin dominance slipped as traders rotated into riskier altcoins.", "text": "The crypto market selloff accelerated overnight with bitcoin BTC$83,642.21 and ether ETH$2,688.36 falling by a further 2.7% and 3.5%, respectively, since midnight UTC to compound Thursday's miserable session.The drawdown comes alongside heavy losses for precious metals, with silver now trading at $96 following a 20% drop from Thursday's record high of $121. Gold is trading back below $5,000 after tumbling by 11% from Wednesday's $5,600 high.U.S. equity index futures ticked lower while the dollar index (DXY) posted a 0.57% gain, buoyed by the expectation that Kevin Warsh looks set to become new the Federal Reserve chairman.The global market rout, which saw bitcoin hit its lowest level since November, led to $1.8 billion in liquidations across crypto markets as leverage traders were caught off-guard by the precipitous fall despite a weak start to the year for crypto.The bitcoin-dominant CoinDesk 20 Index (CD20) is now down by 6.6% since the turn of the year while the altcoin heavy CoinDesk 80 (CD80), outperforming its counterpart, has lost 2.28%.", "tags": ["Crypto Markets Today", "Derivatives"]}
{"topic": "markets", "art_add": "https://www.coindesk.com/markets/2026/01/30/gold-s-six-month-rally-versus-bitcoin-shows-similarities-to-the-2019-cycle", "art_title": "Gold's six-month rally versus bitcoin shows similarities to the 2019 cycle", "discribtion": "The bitcoin-to-gold ratio rebounded from recent lows, mirroring a pattern seen in the 2019-2020.", "writer": "James Van Straten", "time": "UpdatedJan 30, 2026, 5:21 p.m.", "what_to_know": "Bitcoin is on track for a sixth consecutive red monthly candle against gold, a pattern last seen in 2019/20. The bitcoin-to-gold ratio has rebounded to around 16.3 after briefly falling to 15.5 as gold and silver declined more sharply than bitcoin over the past 24 hours. A potential bottom in the ratio would not necessarily signal bitcoin strength, but could instead reflect continued underperformance in gold relative to bitcoin", "text": "Bitcoin BTC$83,642.21 is on track to end January underperforming gold for the sixth straight month as investors ignore the largest cryptocurrency's \"digital gold\" moniker and seek the safety of a metal that's historically been seen as a haven in times of economic and geopolitical turmoil.The bitcoin-to-gold ratio, the amount of gold equivalent to 1 BTC, has dropped 23% this month, and is currently standing at 16.3. The six-month pattern closely resembles what happened in 2019, when the sequence began in August and ended in January the following year. Back then, bitcoin outperformed gold for the following five months.The first signs of a retrenchment may be emerging. The ratio rebounded Friday by 4% after dropping to as low as 15.5 on Thursday. That low coincided with a sharp selloff across global markets, with risk assets declining aggressively. Bitcoin is currently hovering around $82,000, down just over 2% since midnight UTC. By comparison, gold has fallen more than 8% and silver roughly 16%. From the peak in late 2024, the bitcoin-to-gold ratio has declined by roughly 60%, placing bitcoin in a technical bear market against gold for around 14 months. Even if the ratio has now bottomed, that does not automatically imply a strong upside for bitcoin. It may simply reflect gold continuing to weaken at a faster rate than bitcoin.", "tags": ["Bitcoin News", "Gold"]}
{"topic": "markets", "art_add": "https://www.coindesk.com/markets/2026/01/30/u-s-dollar-strength-and-volatility-surge-as-markets-nervously-await-u-s-open", "art_title": "U.S. dollar strength and volatility surge as markets nervously await U.S. open", "discribtion": "While Fed chair speculation drives uncertainty across equities, rates, and crypto.", "writer": "James Van Straten", "time": "Jan 30, 2026, 10:47 a.m.", "what_to_know": "Reports suggest the Trump administration may announce Kevin Warsh as the next Federal Reserve chair, replacing Jerome Powell. The VIX is up 13%, while the MOVE Index has climbed 6%, highlighting elevated uncertainty across both equity and Treasury markets. The DXY index is edging higher, reinforcing a risk off tone as U.S. equities trade lower ahead of the open.", "text": "The Trump administration is reportedly preparing to announce Kevin Warsh as the next Federal Reserve chair on Friday, replacing Jerome Powell, a development that has unsettled markets and triggered a broad selloff across asset classes.As a result risk sentiment has deteriorated as investors price in potential shifts in monetary policy direction.Meanwhile, the DXY index, which tracks the strength of the U.S. dollar against a basket of major currencies, has edged up to 96.6. U.S. Treasury yields are modestly higher, with the 10 year benchmark yield at approximately 4.25%.Volatility has surged with the Volatility Index (VIX) up 13% and the MOVE Index, which tracks volatility in the U.S. Treasury market, higher by 6%.In Friday pre-market trading, the Invesco QQQ (QQQ) is down more than 1%, trading around $622 per share. Bitcoin has fallen significantly, sliding to $82,000. As a result of this drop, bitcoin has fallen out of the top ten global assets by market capitalization and now ranks eleventh, with a market cap of $1.6 trillion.Equities tied to bitcoin have followed suit. Strategy (MSTR), the largest publicly traded holder of bitcoin, is down 4% in pre market trading after falling roughly 10% on Thursday, now trading near $138. In the bitcoin mining and AI sector, IREN (IREN) is down 5% at $57, while Cipher Mining (CIFR) is lower by 4%. While both Galaxy Digital (GLXY) and Coinbase (COIN) are down 3%.Metals have absorbed much of the downside during the last 24 hours. Gold has retreated toward $5,000 per ounce, while silver has fallen back to around $100 per ounce. Other commodities have also weakened, with copper and oil both trading lower.", "tags": ["Bitcoin News", "Gold", "US"]}
{"topic": "markets", "art_add": "https://www.coindesk.com/markets/2026/01/30/u-s-listed-bitcoin-ether-etfs-bleed-nearly-usd1-billion-in-one-day", "art_title": "U.S. listed bitcoin, ether ETFs bleed nearly $1 billion in a day", "discribtion": "U.S.-listed spot bitcoin and ether ETFs saw one of their worst combined outflow days of 2026 as falling prices, rising volatility and macro uncertainty pushed investors to cut exposure.", "writer": "Shaurya Malwa", "time": "UpdatedJan 30, 2026, 5:47 p.m.", "what_to_know": "U.S.-listed spot bitcoin and ether ETFs saw nearly $1 billion in outflows in a single session, as crypto prices tumbled and risk appetite faded. Bitcoin dropped below $85,000 and briefly neared $81,000, while ether fell more than 7%, prompting heavy redemptions from major ETFs run by BlackRock, Fidelity and Grayscale. Analysts say the synchronized ETF selling reflects institutions cutting overall crypto exposure amid rising volatility, hawkish Federal Reserve expectations and forced unwinding of leveraged positions, though some see the move as a leverage shakeout rather than the start of a bear market.", "text": "U.S.-listed spot bitcoin and ether exchange-traded funds (ETFs) suffered heavy redemptions on Thursday, with nearly $1 billion yanked in single session as crypto prices slid sharply and risk appetite evaporated.According to SoSoValue data, investors withdrew $817.9 million from U.S. spot bitcoin ETFs on Jan. 29, the largest daily outflow since Nov. 20. Ether ETFs also saw sustained selling, losing $155.6 million on the day.The outflows coincided with a sharp drop in crypto prices. Bitcoin fell through $85,000 and later slid toward $81,000 in U.S. trading hours, before nearing the $83,000 mark in Asian morning hours Friday. Ether dropped more than 7% on the day. BlackRock’s IBIT bore the brunt of bitcoin ETF redemptions, shedding $317.8 million. Fidelity’s FBTC lost $168 million, while Grayscale’s GBTC saw $119.4 million exit. Smaller products were not spared, with Bitwise, Ark 21Shares and VanEck all posting meaningful outflows.Ether ETFs followed a similar pattern. BlackRock’s ETHA lost $54.9 million, Fidelity’s FETH saw $59.2 million exit and Grayscale’s ETH products continued to bleed assets. Total ether ETF assets fell to $16.75 billion, down from more than $18 billion earlier this month.The synchronized selling across bitcoin and ether ETFs suggests institutional investors were reducing overall crypto exposure rather than rotating between assets. That marks a shift from earlier in January, when inflows into ether funds often offset weakness in bitcoin products.The selloff came amid rising volatility across risk assets and renewed uncertainty around U.S. economic policy, with analysts deeming Fed contender Kevin Warsh as bearish for bitcoin.Rising implied volatility, weakness in equities, and speculation around future Federal Reserve leadership weighed on sentiment. At the same time, leveraged positioning in crypto markets was unwound aggressively, adding pressure to spot prices.For now, ETF flows appear to be tracking price action rather than leading it. As long as bitcoin and ether remain under pressure, analysts expect ETF demand to stay fragile, with investors waiting for volatility to cool before stepping back in.\"Bitcoin crashed to $81k due to a risk-off wave: hawkish Fed holding rates with no cuts soon, heavy spot BTC ETF outflows ($1B+ recently), geopolitical tensions (US-Europe trade spats, Middle East), and a brief gold/silver dip,\" Andri Fauzan Adziima, Research Lead at Bitrue, said in a Telegram message. \"This triggered massive leveraged liquidations after breaking key support (~$85k 100-week SMA), creating a self-reinforcing sell-off in thin liquidity. It's a leverage shakeout amid macro pressure, not the start of a bear market, with rebound potential if supports hold,\" Adziima added.", "tags": ["Bitcoin News", "Ethereum News", "Bitcoin ETF", "ether ETF"]}
{"topic": "markets", "art_add": "https://www.coindesk.com/markets/2026/01/30/binance-is-shifting-its-user-security-fund-from-stablecoins-to-bitcoin", "art_title": "Binance to shift $1 billion user protection fund into bitcoin amid market rout", "discribtion": "Binance will convert the stablecoin holdings in its $1 billion Secure Asset Fund for Users to bitcoin over the next 30 days, with plans for regular audits.", "writer": "Omkar Godbole", "time": "Jan 30, 2026, 6:30 a.m.", "what_to_know": "Binance will convert the stablecoin holdings in its $1 billion Secure Asset Fund for Users to bitcoin over the next 30 days, with plans for regular audits. The exchange has pledged to replenish the fund to $1 billion if bitcoin price swings cause its value to fall below $800 million. Binance framed the change as part of its long-term industry-building efforts.", "text": "Top cryptocurrency exchange Binance announced said Friday that it shall switch the stablecoin in its $1 billion emergency user protection fund to bitcoin over the next 30 days. The move targets the Secure asset Fund for Users (SAFU), which is a security fund created to protect users from losses due to unforeseen events such as hacks. The exchange plans to gradually convert the stablecoin holdings within 30 days, committing to regular audits. It added that if bitcoin's price swings drop the fund's value below $800 million, the exchange will top it back up to $1 billion.\"This initiative is part of Binance's long-term industry-building efforts, and we will continue to advance related work, gradually sharing more progress with the community,\" the translated version of the exchange's post on X, said. As of 2025, the exchange's proof-of-reserves report showed users holding roughly $163 billion in crypto tokens on the platform. Stablecoins are digital tokens with values pegged to an external reference such as the U.S. dollar. Bitcoin is the world's leading cryptocurrency with a market value of over $1.6 trillion.", "tags": ["Binance", "Bitcoin News"]}
{"topic": "markets", "art_add": "https://www.coindesk.com/markets/2026/01/30/gold-silver-copper-pullback-triggers-usd120-million-liquidations-tied-to-tokenized-metals", "art_title": "Plunge in gold, silver, and copper sparks $120 million rout in blockchain metal clones", "discribtion": "Metals remain a leading theme for the year while bitcoin trades independently, suggestive of its growing role as a standalone risk asset.", "writer": "Shaurya Malwa", "time": "UpdatedJan 30, 2026, 6:50 a.m.", "what_to_know": "Copper prices retreated sharply from record highs after a week of extreme volatility on the London Metal Exchange and shifting positions by Chinese traders. The pullback in metals spilled into crypto markets, where tokenized copper, gold and silver products saw about $120 million in liquidations as traders used crypto venues as alternative macro trading rails. Despite Friday’s setback, metals remain a leading theme for the year, while bitcoin traded largely independently, suggestive of its growing role as a standalone risk asset rather than a macro proxy.", "text": "The crypto market's tight links with traditional markets laid bare Friday as a sharp slide in metal prices shook out millions in leveraged bets on blockchain versions of gold, silver, and copper.Three-month copper futures on the London Metal Exchange (LME) fell nearly 4% from Thursday’s peak above $14,500 a ton, settling closer to $13,000 amid technical disruptions at the LME, and a sharp shift in positioning by Chinese traders. The move marked a pause after a relentless run driven by Chinese demand, energy transition optimism and a weaker U.S. dollar. Gold and silver prices fell by 4% and 5.9%, respectively. That retrenchment showed up quickly in crypto markets. Tokenized metals products tied to copper, gold and silver saw an usually-high spike in losses as their spot prices cooled. Across exchanges, derivatives and spot-style products linked to metals logged roughly $120 million in combined liquidations over the past 24 hours. Silver-linked contracts led the pack at $32 million in losses, followed by gold- and copper-linked futures. Prices for tokenized bullion products like XAU and XAUT dropped over 7%.These liquidations reflect how crypto venues are increasingly being used as complementary rails for macro trades. When metals were ripping higher earlier this week, traders leaned into crypto-native contracts for speed, leverage and round-the-clock access. As prices rolled over, those same markets became a release valve for risk.The broader pullback in metals came as the U.S. dollar strengthened on speculation that the Trump administration may be preparing to nominate Kevin Warsh as the next Federal Reserve chair. A firmer dollar tends to pressure commodities priced in greenbacks, and Friday’s move hit metals across the board. Gold fell sharply from record highs, while silver, crude oil and iron ore also moved lower.Even with the setback, however, metals remain one of the strongest themes of the year so far. Copper is still headed for a strong weekly gain, having recently rallied on supply constraints and electrification demand, while gold continues to attract flows as investors hedge political and fiscal uncertainty. Crypto markets are increasingly along for that ride – not as a separate trade, but as a parallel venue where global macro bets now play out in real time.", "tags": ["Gold", "Silver", "Copper", "Tokenization"]}
{"topic": "markets", "art_add": "https://www.coindesk.com/markets/2026/01/30/here-s-why-fed-contender-kevin-warsh-is-seen-as-bearish-for-bitcoin", "art_title": "Here's why Fed contender Kevin Warsh is seen as bearish for bitcoin", "discribtion": "BTC fell deeper to nearly $81,000 late Thursday as Warsh's odds surged in betting markets.", "writer": "Omkar Godbole", "time": "UpdatedJan 30, 2026, 1:02 p.m.", "what_to_know": "President Donald Trump is expected to soon announce a successor to Federal Reserve Chair Jerome Powell, with former Fed Governor Kevin Warsh emerging as a leading contender. Warsh's record of prioritizing inflation risks during the global financial crisis and his bias for monetary discipline has spooked analysts and markets. BTC fell deeper to nearly $81,000 late Thursday as Warsh's odds surged in betting markets.", "text": "On Thursday, President Donald Trump said he will announce his pick for the U.S. Federal Reserve chair to replace incumbent Jerome Powell after the latter's term ends in May.While nothing is confirmed yet, reports suggest the Trump administration is preparing to nominate Kevin Warsh, who served on the Federal Reserve Board of Governors from 2006 to 2011. Warsh has occasionally praised cryptocurrencies. Yet bitcoin BTC$83,642.21 plunged late Thursday to near $81,000 lows as his odds spiked on betting sites, with some analysts now pegging him as a bearish force for the asset.\"Markets generally view a resurgence of Warsh's influence as bearish for Bitcoin, as his emphasis on monetary discipline, higher real rates, and reduced liquidity frames crypto not as a hedge against debasement but as a speculative excess that fades when easy money is withdrawn,\" Markus Thielen, founder of 10x Research, told CoinDesk.Higher real interest rates mean the actual cost of borrowing money after accounting for inflation is elevated. Think of it as the \"true\" interest rate that hits your finances harder. When real rates are elevated, businesses and investors typically scale back exposure to risky investments such as bitcoin.Warsh's track record is adding fuel to the fire. During the global financial crisis (GFC) that lasted from December 2007 to June 2009, Warsh repeatedly cited inflation risks even as the global economy teetered on the brink of a full-blown deflation.For instance, in September 2008, the month when Lehman Brothers collapsed, Warsh said, \"I'm still not ready to relinquish my concerns on the inflation front.\"Seven months later, when the Fed's preferred inflation measure was at 0.8% and the jobless rate at 9%, he said, \"I continue to be more worried about upside risks to inflation than downside risks.\"Over the years, many observers have argued that Warsh's hawkishness and failure to acknowledge deflation risks exacerbated the crisis.\"From this perspective, his approach would likely have resulted in higher unemployment, slower recoveries, and greater deflation risk during the 2010s,\" Thielen said.All this makes a potential Warsh pick as ironic, as the former Fed governor's hawkish record clashes sharply with Trump's reflationary, pro-risk asset playbook. Trump has repeatedly bashed Powell, often resorting to personal attacks for keeping rates elevated and killing the economy. The President has stressed the need for rapid rate cuts, calling for interest rates to be as low as 1% from the present window of 3.5%-3.7%.Hence, several observers say Warsh is a wrong pick for the Fed that's expected to toe Trump's line. \"Kevin Warsh has been a monetary policy hawk his entire career and most importantly, during a time when the labor markets fell out of bed. His dovishness today stems from convenience. The President risks getting duped,\" Renaissance Macro Research said on X.\"I read the fomc transcripts during the GFC. His quotes scared me,\" Bloomberg's Chief U.S. Economist Ana Wong said. Thankfully, even as Fed chair, Warsh cannot dictate rates alone, as the Board of Governors votes collectively, diluting any single voice. It remains to be seen if Trump goes ahead with Warsh.Until then, his hawkish history may keep spooking risk assets, bolstering the dollar in the interim.", "tags": ["Bitcoin News", "Federal Reserve"]}
